const movieList = [
   
    {
        title: 'Ballerina',
        year: '2025',
        genre: ['ACTION'],
        rating: '7.4',
        releaseDate: '2025-06-04',
        cast: ['Ana de Armas', 'Keanu Reeves', 'Ian McShane', 'Anjelica Huston', 'Gabriel Byrne', 'Catalina Sandino Moreno', 'Ava McCarthy', 'Juliet Doherty', 'Norman Reedus', 'Lance Reddick', 'Sharon Duncan-Brewster', 'David Castañeda', 'Victoria Comte', 'Robert Maaser', 'Sooyoung Choi', 'Jung Doo-hong', 'Anne Parillaud', 'Marc Cram', 'Rila Fukushima', 'Abraham Popoola', 'Magdalena Šittová', 'Waris Ahluwalia', 'Daniel Bernhardt', 'Anna Schmidtmajerová', 'Emílie Páclová'],
        poster: 'https://images.plex.tv/photo?size=large-1920&scale=1&url=https%3A%2F%2Fmetadata-static.plex.tv%2Fa%2Fplex%2Fa3d9b641-933e-49b7-92e7-9d3ab891e7f0.jpg',
        banner: 'https://img.nowrunning.com/content/movie/2025/balle-30939/bg-video62202533718.jpg',
        englishDescription: `A spin-off from the John Wick franchise, this film follows a female assassin trained in the Ruska Roma tradition as she seeks revenge on those who killed her family.`,
        description: `ඒ සුප්‍රසිද්ධ John Wick චිත්‍රපටමාලාවේ SpinOff චිත්‍රපටයක් ලෙස 2025 වර්ෂයේ නිකුත් වුන From the World of John Wick: Ballerina සිනමාපටය සමගින්. 2025 වසරේ නිකුත් වුන මේ සිනමාපට IMDB දර්ශකයේ 7.2 ක අගයක් සහ කුණු තක්කාලි දර්ශකයේ 76% අගයක් ලබාගෙන තියෙනවා. ඉතින් John wick චිත්‍රපට එක්ක බලපුවාම මේක අලුත් දෙයක් නෙවේ.ඉතින් මෙහි ප්‍රධාන චරිතය රග දක්වන්නෙ කවුරුත් දන්නා සුරූපී නිළි Ana de armas විසින්. ඒ වගේම Keanu Reeves, Ian McShane, Anjelica Huston, Lance Reddick, Norman Reedus, Gabriel Byrne යන නලුනිලියන් මෙහි සෙසු ප්‍රධාන චරිත රග දක්වනවා. චිත්‍රපටයේ නිෂ්පාදන වියදම ලෙස ඩොලර් මිලියන 90ක් වියදම් වී අතර මේ වන තෙක් ඉපයීමට සමත්ව ඇත්තෙ ඩොලර් මිලියන 110ක් වැනි මුදලක් පමණක් වීම විශ්මයට කරුණක්. බොහෝවිට ජෝන් වික් ප්‍රධාන චරිතය නොවීමත් එයට බලපාන්නට ඇති. එහෙනම් ඒ ගැන නොහිතා කතාව ගැන කෙටි විස්තරයක් කරලා ඉන්නම්.මේ කතාව දිවෙන්නෙ ජෝන් වික් තුන්වැනි සිනමාපටය සහ හතරවැන්න අතර කාලය තමයි. ඒ කියන්නෙ ජෝන් වික්ව මරන්න කියල අධිකාරියෙන් නියෝග ලැබිල හැමෝම පස්සෙන් පන්නන කාලය. මේ කාලයෙදි තමයි මේ ගැහැණු ඝාතකයා ජෝන් වික්ව හමුවෙන්නෙ. ඉතින් ඇය කවුද? ඇයි ඇය ජෝන් වික්ව හමුවෙන්නෙ? ඇයගෙ අරමුණ මොකක්ද? ඒ හැමදේම දැනගන්න නම් මේක බලන්නම වෙනවා.`,
        downloadLink: 'https://t.me/movievresehub/112',
        trailerLink: 'https://www.youtube.com/watch?v=0FSwsrFpkbw&pp=ygUJYmFsbGVyaW5h',
        gallery: [
            'https://i.ytimg.com/vi/7V8S9kjfGaY/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLAEzRBUijlfi6CJgdQmDYIDoxu2mA',
            'https://m.media-amazon.com/images/M/MV5BMTcxOGYwMWMtMTNhMi00ZWZlLTg0OWMtNmQyYTE4YzM1MmIzXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg',
            'https://static1.srcdn.com/wordpress/wp-content/uploads/2024/12/ana-de-armas-holding-a-rifle-in-ballerina.jpg'
        ]
    },
    {
        title: 'Superman',
        year: '2025',
        genre: ['ACTION'],
        rating: '7.4',
        releaseDate: '2025-06-04',
        cast: ['Ana de Armas', 'Keanu Reeves', 'Ian McShane', 'Anjelica Huston', 'Gabriel Byrne', 'Catalina Sandino Moreno', 'Ava McCarthy', 'Juliet Doherty', 'Norman Reedus', 'Lance Reddick', 'Sharon Duncan-Brewster', 'David Castañeda', 'Victoria Comte', 'Robert Maaser', 'Sooyoung Choi', 'Jung Doo-hong', 'Anne Parillaud', 'Marc Cram', 'Rila Fukushima', 'Abraham Popoola', 'Magdalena Šittová', 'Waris Ahluwalia', 'Daniel Bernhardt', 'Anna Schmidtmajerová', 'Emílie Páclová'],
        poster: 'https://images.moviesanywhere.com/8899d06735903d4eaec7c42033d62447/7fccfb51-ced7-4e64-98e8-73d3fc5700df.jpg',
        banner: 'https://preview.redd.it/new-promo-banner-for-superman-2025-v0-3ncbg0g4tz2f1.jpeg?auto=webp&s=ee0f54897d8384ad7a256f17e6ad978863d05f9a',
        englishDescription: `Superman, a journalist in Metropolis, embarks on a journey to reconcile his Kryptonian heritage with his human upbringing as Clark Kent.

Release Date: 2025-07-09

Rating: 7.6IMDb Logo

Cast
David Corenswet, Rachel Brosnahan, Nicholas Hoult, Edi Gathegi, Nathan Fillion, Isabela Merced, María Gabriela de Faría, Skyler Gisondo, Alan Tudyk, Grace Chan, Bradley Cooper, Angela Sarafyan, Michael Rooker, Pom Klementieff, Sara Sampaio, Tatiana Piper, Stephen Blackehart, Giovannie Cruz, Bonnie Discepolo, Terence Rosemore, Natasha Halevi, Adriana Leonard, Paul Kim, Jonah Lees, Christian Lees`,
        description: `හරි අපි අලුත්ම චිත්‍රපටිය ගැන කතා කරන්න කලින් පොඩ්ඩක් Superman ෆ්‍රැන්චයිස් එක සම්බන්ධ තොරතුරු ටිකක් බලමු.

Superman කියන්නේ DC Comics වෙනුවෙන් 1938දී Jerry Siegel සහ Joe Shuster විසින් නිර් මාණය කරපු කොමික් චරිතයක්. චිත්‍රපටි නිර් මාණය පටන්ගන්නේ 1948 ඉඳන්. පළවෙනි සුපර් මෑන් වෙන්න වාසනාව ලැබුණේ Kirk Alynට. එදා ඉඳන් මේ 2025 වෙනකල් නළුවෝ 15 දෙනෙක් චිත්‍රපට සහ කතාමාලා වල සුපර් මෑන් චරිතයට පණපොවලා තියෙනවා.සැක් ස්නයිඩර් විසින් අධ්‍යක්ෂණය කරපු DC Extended Universe (DCEU) එකේ අවසානයත් එක්ක Warner Bros ආයතනය ජේම්ස් ගන්ට ආරාධනා කරනවා අලුතින්ම DC Universe යුනිවර් ස් එක රීබූට් කරන්න. මේ භාරදූර වැඩේ අතට ගත්ත ජේම්ස් ගන් අවුරුදු 10ක විතර සැලැසුමක් ගහලා වැඩේට බහිනවා. David Corenswetව අලුත්ම සුපර් මෑන් විදිහට කාස්ට් කරනවත් එක්කම ප්‍රේක්ෂකයන්ගේ මේ ගැන අවධානය වැඩිවෙන්න පටන්ගත්තා. වැඩි කතාබහක් එක්ක පොඩ්ඩක් වැඩේ චාටර් වෙයි කියලා කතාව පැතිරුණා. ඒත් සාර් ථක Guardians of the Galaxy චිත්‍රපට නිර් මාණය කරපු ජේම්ස් ගන් මේකත් ලස්සනට ගොඩදැම්මා.
දැන් අපි Superman (2025) අලුත් චිත්‍රපටය දිහාවට එමු.
Action/Sci-fi ගණයට වැටෙන චිත්‍රපටිය අධ්‍යක්ෂණය සහ රචනය කරන්නේ ජේම්ස් ගන්. චිත්‍රපටියේ ධාවන කාලය පැය 2 මිනිත්තු 10ක් වෙනවා වගේම බෙදාහරින්නේ Warner Bros. Pictures ආයතයනය. ඩො.මි. 225කට ආසන්න වියදමින් නිර් මාණය කරපු චිත්‍රපටය මේ වෙද්දී ඩො.මි 580කට අධික වාර් තාගත ඉහළ ආදායමක් අරන් තියෙනවා. ඒ පරණ රෙකෝඩ් කිහිපයක්මත් බිඳදාමින්.
චිත්‍රපටයේ ප්‍රධාන චරිත නිරූපණය කරන්නේ David Corenswet, Rachel Brosnahan, Nicholas Hoult, Edi Gathegi, Anthony Carrigan ඇතුළු නළු නිලියන් පිරිසක්.
අපිට Justice Gang එකේ ග්‍රීන්ලැන්ටන්, හව්කි ගර් ල්, මිස්ටර් ටෙරිෆික්වයිත් අපිට චිත්‍රපටියෙන් බලාගන්න පුලුවන්. ඒ වගේම ජේම්ස් ගන්ගේ ඊළඟ ප්‍රොජෙක්ට් එක වෙන Super Girl ගැනත් අන්තිමට පොඩි ඉඟියක් අපිට දෙනවා.

හරි මං කතාව කියන්න යන්නේ නෑ එතකොට වැඩක් නෑනේ. ඔයාලම බලන්නකෝ.
හැබැයි චිත්‍රපටිය සුපිරියට තියෙනවා කියලා නම් කියන්න ඕන.`,
        downloadLink: 'https://t.me/movievresehub/122',
        trailerLink: 'https://www.youtube.com/watch?v=Ox8ZLF6cGM0&pp=ygUVc3VwZXJtYW4gdHJhaWxlciAyMDI10gcJCa0JAYcqIYzv',
        gallery: [
            'https://specials-images.forbesimg.com/imageserve/68262b9ebc7486b62eaa8349/960x0.jpg',
            'https://www.usmagazine.com/wp-content/uploads/2024/12/everything-we-know-about-superman-legacy-cast-and-more-006.jpg?w=1600&h=900&crop=1&quality=86&strip=all',
            'https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1Cn1Z4.img?w=1920&h=1080&m=4&q=94'
        ]
    },
    {
        title: 'Trouble Man!',
        year: '2025',
        genre: ['ACTION'],
        rating: '6.4',
        releaseDate: '2025-08-01',
        cast: ['Michael Jai White, Method Man, La La Anthony, Orlando Jones, Levy Tran, Mike Epps, Gillian White, Daniel Lue, Déjá Dee, Arnold Chon, Laimarie Serrano, Steven Shelby, Terrance Hodges, Ernest Miller, Daniel Chung'],
        poster: 'https://m.media-amazon.com/images/M/MV5BZDI3Y2RiNmEtZWJjOS00YWM5LThhMzAtN2NkMjc4ZDkxNTM3XkEyXkFqcGc@._V1_.jpg',
        banner: 'https://resizing.flixster.com/YrOh9IOSip8qGngJJH02ooBg-_c=/fit-in/352x330/v2/https://resizing.flixster.com/-XZAfHZM39UwaGJIFWKAE8fS0ak=/v3/t/assets/p30630306_i_h8_ab.jpg',
        englishDescription: `Jaxen, a former cop turned Atlanta PI, is hired to find missing R&B star Jahari. His investigation uncovers her disappearance is connected to a larger conspiracy, forcing him to question those around him and his own past.

Release Date: 2025-08-01

Rating: 6.4IMDb Logo

Cast
Michael Jai White, Method Man, La La Anthony, Orlando Jones, Levy Tran, Mike Epps, Gillian White, Daniel Lue, Déjá Dee, Arnold Chon, Laimarie Serrano, Steven Shelby, Terrance Hodges, Ernest Miller, Daniel Chung`,
        description: `ජැක්සන් කියන්නේ කලින් දක්ෂ පොලිස් නිලධාරියෙක්, හැබැයි දැන් ඔහු ඇට්ලන්ටා නගරයේ පෞද්ගලික රහස් පරීක්ෂකයෙක්. 🕵️‍♂️ දවසක් ඔහුට අමුතුම වැඩක් පැවරෙනවා: එකපාරටම අතුරුදන් වෙලා ඉන්න ජනප්‍රිය R&B ගායිකාවක් වන ජහාරිව 🎤 හොයාගන්න එක.

මේක නිකම්ම නිකන් අතුරුදන්වීමක් කියලා හිතුවත්, පරීක්ෂණ පටන් ගත්තාම ජැක්සන්ට තේරෙනවා මේක පිටිපස්සේ හිතනවට වඩා ලොකු කුමන්ත්‍රණයක් 🕸 තියෙනවා කියලා. මේ ගැටලු ජාලය ලිහන්න යන ජැක්සන්ට තමන් වටේ ඉන්න හැමෝවම වගේම, තමන්ගේම අතීතයත් ප්‍රශ්න කරන්න සිද්ධ වෙනවා. 💥 ඇත්තටම ජහාරිට මොකද වුණේ? ජැක්සන් මේ “කරදරකාරයා” වෙලා තියෙන ප්‍රශ්නයෙන් ගැලවෙයිද?

✍️ උපසිරැසියට ජීවය දුන් මගේ අදහස (My Opinion as the Subtitler):

මේ චිත්‍රපටියට උපසිරැසි ගන්වපු කෙනා විදියට මට මේක ගැන දැනෙන දේ තමා… ඇත්තම කිව්වොත්, මේක ලොකු බලාපොරොත්තු තියාගෙන බලන්න ඕන, සම්මාන දිනන වර්ගයේ චිත්‍රපටියක් නෙවෙයි. 😅 හැබැයි IMDb අගය බලලා මේක මඟ අරින්නත් එපා.

සරල කතාවක් එක්ක පොඩි Action ටිකකුයි, හිතට සැහැල්ලුවක් ගේන Comedy ටිකකුයි බලාගන්න කැමති කෙනෙක්ට නම් මේක හොඳ තේරීමක්. ජැක්සන්ගේ චරිතය, තමන්ගේම ප්‍රශ්න මැද්දේ අනිත් අයගේ ප්‍රශ්න විසඳන්න දඟලන හැටි බලන්න ආස හිතෙනවා. 😎 වෙලාවකට ඇක්ෂන්, වෙලාවකට කොමඩි, ඒ දෙකේම මිශ්‍රණයක් එක්ක පැය එකහමාරක් විතර මොලේට වදයක් නැතුව බලන්න පුළුවන් ෆිල්ම් එකක්. 👍

👨‍👩‍👧‍👦 දැනුම් දීම (Audience Guidance):

චිත්‍රපටයේ ඇති ක්‍රියාදාම සහ ඇතැම් වැඩිහිටි තේමාවන් නිසා, මෙය වැඩිහිටියන්ට වඩාත් සුදුසු නිර්මාණයකි. 🔞`,
        downloadLink: 'https://t.me/movievresehub/112',
        trailerLink: 'https://www.youtube.com/watch?v=9FGMLU3LYU0&pp=ygUMVHJvdWJsZSBNYW4h',
        gallery: [
            'https://www.metacritic.com/a/img/resize/bbf5d133a390d2c5c1363652ffaeab17a7c1bc39/catalog/provider/2/13/2-831710d6ed32d5261fc771be16576cff.jpg?auto=webp&fit=crop&height=675&width=1200',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQxaHmszpXJJ13L9oPPdvcVHzkhwmfttsl7wA&s',
            'https://image.tmdb.org/t/p/w1280/q6DLjPZM7tMeNcLNjgyyRfamnuT.jpg'
        ]
    },
    {
        title: 'Jurassic World Rebirth',
        year: '2025',
        genre: ['ACTION'],
        rating: '7.4',
        releaseDate: '2025-06-04',
        cast: ['Ana de Armas', 'Keanu Reeves', 'Ian McShane', 'Anjelica Huston', 'Gabriel Byrne', 'Catalina Sandino Moreno', 'Ava McCarthy', 'Juliet Doherty', 'Norman Reedus', 'Lance Reddick', 'Sharon Duncan-Brewster', 'David Castañeda', 'Victoria Comte', 'Robert Maaser', 'Sooyoung Choi', 'Jung Doo-hong', 'Anne Parillaud', 'Marc Cram', 'Rila Fukushima', 'Abraham Popoola', 'Magdalena Šittová', 'Waris Ahluwalia', 'Daniel Bernhardt', 'Anna Schmidtmajerová', 'Emílie Páclová'],
        poster: 'https://s3.amazonaws.com/nightjarprod/content/uploads/sites/130/2025/06/13172640/q0fGCmjLu42MPlSO9OYWpI5w86I-scaled.jpg',
        banner: 'https://i0.wp.com/thefutureoftheforce.com/wp-content/uploads/2025/05/A-Treassure-Trove-of-New-Posters-for-Jurassic-World-Rebirth-Emerge-From-The-Park.jpg?fit=1024%2C576&ssl=1',
        englishDescription: `Five years after the events of Jurassic World Dominion, covert operations expert Zora Bennett is contracted to lead a skilled team on a top-secret mission to secure genetic material from the world's three most massive dinosaurs. When Zora's operation intersects with a civilian family whose boating expedition was capsized, they all find themselves stranded on an island where they come face-to-face with a sinister, shocking discovery that's been hidden from the world for decades.

Release Date: 2025-07-01

Rating: 6.4IMDb Logo

Cast
Scarlett Johansson, Jonathan Bailey, Mahershala Ali, Rupert Friend, Manuel Garcia-Rulfo, Luna Blaise, David Iacono, Audrina Miranda, Bechir Sylvain, Philippine Velge, Ed Skrein, Adam Loxley, Niamh Finlay, Julian Edgar, Lucy Thackeray, Billy Smith, Jonny Lavelle`,
        description: `2008 අවුරුද්දේ පර්යේෂණ කණ්ඩායමක් විසින් ජාන විකෘති කිරීම් ද සහිතව අලුත් ඩයිනෝසර විශේෂ බිහි කිරීමේ මධ්‍යස්ථානයක් පවත්වා ගෙන යනවා. මේකේ ඵලයක් විදිහට Distortus Rex කියන අති බිහිසුණු විකෘති ඩයිනෝසරයා නිර්මාණය වීම සිද්ධ වෙනවා.

 

Distortus Rex ගැන කෙටි හැඳින්වීමක්

මේ මධ්‍යස්ථානයේ සිදුවන යම් සිද්ධියකට පස්සේ 2025 අවුරුද්දේ මාටින් ක්‍රෙබ්ස් (Rupert Friend) කියන ඖෂධ සමාගමක විධායකවරයෙක් සෝරා බෙනට් (Scarlett Johansson) කියන හිටපු හමුදා නිලධාරිනියව හමු වෙනවා ලොකු උදව්වක් බලාගෙන. ඒ Île Saint-Hubert දූපතට ගිහින් ඩයිනෝසර විශේෂ වල ලේ සාම්පල ලබා ගන්න. මේ සාම්පල කිරීටක ධමනිය හා සම්බන්ධ හදවත් රෝගයකට ඖෂධයක් හදන්න තමයි එයා පාවිච්චි කරන්න බලාපොරොත්තු වෙන්නේ. ඉතින් මේ ලේ සාම්පල ලබා ගැනීම සඳහා හොඳම ඩයිනෝසර විශේෂ තුනක් ඉන්නවා කියලා ගමනට එකතු වෙන හෙන්රි ලූමිස් (Jonathan Bailey) කියනවා. ඒ උපදෙස් අනුව මේ තුන් දෙනා Île Saint-Hubert දූපතට ගිහින් කරන වික්රමාන්විතය තමයි සරලව මේ කතාව තුලින් ඔයාලට බලා ගන්න පුළුවන් වෙන්නේ.

ඉහත කියපු චරිත වලට අතිරේකව ඩන්කන් කින්කේඩ් (Mahershala Ali), සහ තවත් නළු නිළියන් කිහිප දෙනෙකු මේ කතාවේ සැලකිය යුතු කාලයක් රංගනයේ යෙදෙනවා.

කතාව සම්බන්ධයෙන් හොඳ නරක කවලමේ අහන්න ලැබෙනවා. කතාවේ ඇති සරල බව, Distortus Rex වැඩිපුර දකින්න නොලැබීම කියන කාරණා දෙක තමයි වැඩි දෙනාගේ අකමැත්තට හේතු වෙන්නේ. හැබැයි ගොඩක් අය (මමත් ඇතුළුව) මීට කලින් ආපු Jurassic World: Dominion (2022) චිත්‍රපටයට වඩා නම් මේකට හොඳ කියනවා.

සුපුරුදු විදිහට Universal Pictures සමාගමත් Amblin Entertainment සමාගමත් එකතු වෙලා කරපු මේ නිර්මාණය පැය දෙකකුත් විනාඩි 13 කට ආසන්න වෙලාවක් ධාවනය වෙනවා. IMDb අගය 6.2 ක් වගේම Rotten Tomatoes අගය 51% ක් එකකුත් මේ වෙනකොට ලබාගෙන තිබෙන මෙය Action/Sci-fi කාණ්ඩ වලට තමයි වැටෙන්නේ.

ලේ සාම්පල වලට තෝරා ගන්නා ඩයිනෝසරයන්

Mosasaurus

මියුස් විලේ කටුස්සා (lizard of the Meuse River) යන අන්වර්ථ නාමයෙන් හඳුන්වන Mosasaurus මම කලින් කිව්වා වගේ කරලියට ආවේ Jurassic World පළමු චිත්‍රපටය හරහායි. මීට අවුරුදු මිලියන 82 ත් 66 ත් අතර කාලයකට පෙර ජීවත් උන මේ මාංශ භක්ෂක සත්වයා බරින් ආසන්න වශයෙන් කිලෝ 10,000 ක් පමණ වෙනවා.

Titanosaurus

අති විශාල කටුස්සා (titanic lizard) යන අන්වර්ථ නාමයෙන් හඳුන්වන Titanosaurus ශාක භක්ෂක සත්වයෙක්. මෙයා ජීවත් උනේ මීට අවුරුදු මිලියන 145 ත් 66 ත් අතර කාලයකට පෙරයි. බරින් ආසන්න වශයෙන් කිලෝ 13,000 ක් පමණ වෙනවා. ඉතා දිගු වලිගයකට හිමිකම් කියයි.

Quetzalcoatlus

පිහාටු ඇති සර්ප දෙවියා (feathered serpent god) යන අන්වර්ථ නාමයෙන් හඳුන්වන Quetzalcoatlus, පක්ෂී ගණයට අයත් මාංශ භක්ෂක ඩයිනෝසරයෙක් වන මෙයා නම් සාපේක්ෂව වැඩිය බර නැහැ. ඒ කියන්නේ කිලෝ 200 ත් 250 ත් අතර බරක් තමයි මෙයාට තියෙන්නේ. ජීවත් උනේ මීට අවුරුදු මිලියන 72 ත් 66 ත් අතර කාලයකට පෙරයි.`,
        downloadLink: 'https://t.me/movievresehub/120',
        trailerLink: 'https://www.youtube.com/watch?v=jan5CFWs9ic&pp=ygUWSnVyYXNzaWMgV29ybGQgUmViaXJ0aA%3D%3D',
        gallery: [
            'https://media.gq.com/photos/6866b2c891d3236808226fe4/3:2/w_1821,h_1214,c_limit/MCDJUWO_UV117.jpg',
            'https://insidethemagic.net/wp-content/uploads/2025/02/Untitled-design-27.jpg',
            'https://www.slashfilm.com/img/gallery/the-biggest-problem-with-the-first-jurassic-world-movie-still-lingers-in-rebirth/intro-1751566415.jpg'
        ]
    },
    {
        title: 'Armed ',
        year: '2025',
        genre: ['HORROR'],
        rating: '7.4',
        releaseDate: '2025-06-04',
        cast: ['Ana de Armas', 'Keanu Reeves', 'Ian McShane', 'Anjelica Huston', 'Gabriel Byrne', 'Catalina Sandino Moreno', 'Ava McCarthy', 'Juliet Doherty', 'Norman Reedus', 'Lance Reddick', 'Sharon Duncan-Brewster', 'David Castañeda', 'Victoria Comte', 'Robert Maaser', 'Sooyoung Choi', 'Jung Doo-hong', 'Anne Parillaud', 'Marc Cram', 'Rila Fukushima', 'Abraham Popoola', 'Magdalena Šittová', 'Waris Ahluwalia', 'Daniel Bernhardt', 'Anna Schmidtmajerová', 'Emílie Páclová'],
        poster: 'https://m.media-amazon.com/images/M/MV5BMjc3MjM0MjItYzUyZC00ODg1LTljZTgtMGIzNDVjNjk1NTdjXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg',
        banner: 'https://images.plex.tv/photo?size=large-1280&url=https%3A%2F%2Fmetadata-static.plex.tv%2Fb%2Fgracenote%2Fbd647303edb09b59cfa57cc69656bff7.jpg',
        englishDescription: `A group of veteran marines steal a shipment of weapons from the military only to find a Cold War era robot that hunts them down, determined to complete its mission. Nothing can stop this deadly killing machine.

Release Date: 2025-03-04

Rating: 3.5IMDb Logo

Cast
Omar Tucci, Mason Cromwell, Rick Amsbury, Greg Johnston, Danny Walton, Babak Baharestan, Red Carlsen, Quinton Neufeldt, Iraj Sanjari, Mark Starratt, Thomas Joseph O'Neill, Mike Sniezek, Riley Lewis, Lauren Vastano, Darren Ricketts, Rob VanSpall, Jeff Lasseter, Ismael Gunea-Romero`,
        description: `අති දක්ෂ, පළපුරුදු මැරීන් භටයන් පිරිසක් ඉතාමත් නිර්භීත සහ අවදානම් සහගත කොල්ලයකට අත ගසනවා. ඔවුන්ගේ ඉලක්කය වන්නේ හමුදාව සතු අති ප්‍රබල, නවීන අවි ආයුධ තොගයක් තම සන්තකයට ගැනීමයි. සැලැස්ම පරිදි සියල්ල සිදුවන බවක් පෙනුනත්, ඔවුන් ඒ ආයුධ තොගයත් සමඟ අත්වැරදීමකින් හෝ සොරකම් කරන්නේ, ඔවුන්ගේ ජීවිත සදාකාලික නිරයක් බවට පත්කරන රහසක්!

ඒ තමා… සීතල යුධ සමයේ නිර්මාණය කර, පසුව අමතක කර දමන ලද, මරණය රැගෙන එන රොබෝ යන්ත්‍රයක්! කිසිදා තම මෙහෙයුම අත්නොහරින ලෙසට වැඩසටහන්ගත කර ඇති මේ නිර්දය යන්ත්‍රය, ආයුධ සොරුන් ලෙස සලකා මැරීන් භටයින්ව එකිනෙකා පසුපස ලුහුබඳිමින්, ඔවුන්ව විනාශ කිරීමට පටන් ගන්නවා. තමන් කළ සොරකමේ වන්දිය ලෙස මේ අනුකම්පා විරහිත යකඩ යන්ත්‍රය අතින් මිය යන්නට ඔවුන්ට සිදුවේවිද? නැතහොත් මේ නොනවතින දඩයමින් බේරී පලා යන්නට ඔවුන්ට කිසියම් මගක් හමුවේවිද?

ක්‍රියාදාම, භීතිය සහ හුස්ම හිරකරවන කුතුහලය එකට කැටි වූ, නොනවතින අරගලයක ඇරඹුමයි මේ!

උපසිරැසිකරුගේ ඇසින්:

මේ චිත්‍රපටියට සිංහල උපසිරැසි ගන්වපු කෙනා හැටියට මට මේ ගැන කියන්න තියෙන්නේ… මේක නම් නිකම්ම නිකම් Action පාරක් නෙවෙයි ඈ! 😱 ඇත්තටම Action, Horror, Thriller කියන රසයන් තුනම නූලට අල්ලලා තියෙන නිර්මාණයක්. අර සීතල යුධ කාලේ අමතක වෙලා හිටපු රොබෝ යකා පස්සෙන් පන්නනකොට නම්… බලාගෙන ඉන්න කෙනාගෙත් ඇඟේ මයිල් කෙලින් වෙන, පපුව ගැස්සිලා යන සීන් තියෙන්නේ! 🤖🔥 ඒ යකඩ යකාගෙන් බේරෙන්න මැරීන් සෙට් එක දෙන ගේම, වෙඩි තියාගන්න හැටි, දුවන පනින හැටි එහෙම සුපිරියටම තියෙනවා. ඒ ටෙන්ෂන් එක උපසිරැසි කරද්දිත් මට හොඳටම දැනුනා කිව්වොත් හරි. හුස්ම ගන්නවත් වෙලාවක් නැති තරමට කුතුහලයයි, බයයි මුළු ෆිල්ම් එක පුරාම රඳවගන්නවා. 7.1 ක IMDb අගයක් ලැබිලා තියෙන එක ගැන කිසිම පුදුමයක් නෑ ඒ නිසා. වෙනස්ම විදියේ අත්දැකීමක් එක්ක හොඳ Thriller/Horror පාරක් බලන්න කැමති අයට නම් මේක නියමෙට සෙට් වෙයි. අනිවා බලන්න කියලා recommend කරනවා! 👍🍿🎬

ප්‍රේක්ෂක නිර්දේශය:

මෙය වැඩිහිටි ප්‍රේක්ෂකයින් සඳහා වඩාත් සුදුසු නිර්මාණයකි. (ප්‍රචණ්ඩත්වය, භීතිය දනවන දර්ශන සහ යම් භාෂා භාවිතයන් අඩංගු විය හැක 🔞).`,
        downloadLink: 'https://t.me/movievresehub/126',
        trailerLink: 'https://www.youtube.com/watch?v=bVhT5VdT9v0&pp=ygUGQXJtZWQg',
        gallery: [
            'https://m.media-amazon.com/images/M/MV5BZGI0NDUyZWEtZGQyMC00MzVjLTgzODYtMzZhMjZiNmQ1NWM1XkEyXkFqcGc@._V1_QL75_UX464_.jpg',
            'https://m.media-amazon.com/images/M/MV5BMTQ0MzAwN2EtYjc4Ny00ZGUyLWFmOWUtODdhOWNlZDhmYWJjXkEyXkFqcGc@._V1_.jpg',
            'https://m.media-amazon.com/images/M/MV5BMDJlODE2NjAtMDMzYS00Y2MyLWEyNGQtZmM3N2E2MTE5NzliXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg'
        ]
    },
    {
        title: 'Ghosted',
        year: '2023',
        genre: ['ROMANCE', 'ACTION', 'COMEDY'],
        rating: '6.9',
        releaseDate: '2023-04-18',
        cast: ['Chris Evans', 'Ana de Armas', 'Adrien Brody', 'Mike Moh', 'Amy Sedaris', 'Tate Donovan', 'Tim Blake Nelson', 'Marwan Kenzari', 'Anna Deavere Smith', 'Lizze Broadway', 'Mustafa Shakir', 'Tiya Sircar', 'Steve Park', 'Burn Gorman', 'Anthony Mackie', 'John Cho', 'Sebastian Stan', 'Ryan Reynolds', 'Humza Shabazz', 'Israel Vaughan', 'Victoria Garcia-Kelleher', 'Jordan Blair Mangold Brown', 'Zane Shaw', 'Stephanie Weis', 'Dexter Fletcher'],
        poster: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRzrzbh778qny1AIXS8pz-fmR9ov8fSufJLEg&s',
        banner: 'https://sm.ign.com/t/ign_br/screenshot/default/blob_vene.1200.jpg',
        englishDescription: `Salt-of-the-earth Cole falls head over heels for enigmatic Sadie—but then makes the shocking discovery that she's a secret agent. Before they can decide on a second date, Cole and Sadie are swept away on an international adventure to save the world.

Release Date: 2023-04-18

Rating: 6.9IMDb Logo

Cast
Chris Evans, Ana de Armas, Adrien Brody, Mike Moh, Amy Sedaris, Tate Donovan, Tim Blake Nelson, Marwan Kenzari, Anna Deavere Smith, Lizze Broadway, Mustafa Shakir, Tiya Sircar, Steve Park, Burn Gorman, Anthony Mackie, John Cho, Sebastian Stan, Ryan Reynolds, Humza Shabazz, Israel Vaughan, Victoria Garcia-Kelleher, Jordan Blair Mangold Brown, Zane Shaw, Stephanie Weis, Dexter Fletcher`,
        description: `සේඩි කියන්නේ එයාගෙ යාලුවෙක් ලගදි නැතිවෙලා ටිකක් අවුලෙන් ඉන්න කෙල්ලෙක්. ඉතින් සේඩි එයාගෙ යාලුවව මතක් වෙන්නත් එක්ක මල් පැලයක් ගන්න කියලා කඩේකට යනවා. එතනදි තමයි මෙයාට කෝල්ව හම්බෙන්නේ. හැබැයි මෙයාලගෙ පටන් ගැන්ම නම් එච්චර හොඳ විදිහට කෙලවර වෙන්නෑ, දෙන්න රන්ඩුවකුත් වෙලා තමයි තවතින්නේ. කොහොම හරි කෝල්ගෙ යාළුවෙක් බල කරනවා සේඩි එක්ක ඇවිදින්න යන්න කියලා. ඉතිං ඒ බල කිරීම මත කොල්ලා සේඩි එක්ක ඇවිදින්න ගිහින් මේ සම්බන්දෙ හිතුවට වඩා දුර යනවා. පස්සෙ තමයි ඔක්කොම වැඩේ කනපිට හැරෙන්නේ. මොකද එදයින් පස්සෙ ඉදන් කෝල්ට සේඩිගෙන් කිසිම කෝල් එකක්වත් මැසේජ් එකක්වත් එන්නැති වෙනවා. පස්සෙ කෝල් හොයාගන්නවා සේඩි ලන්ඩන් වල කියලා, පස්සෙ පොර ලන්ඩන් වලට කෙල්ලව හොයාගෙන ගියාම හිතුවෙවත් නැති අන්තම කරදර ගොඩකට වැටෙනවා. ඇත්තටම කවුද මේ සේඩි? කොහොමද කෝල් මේ කරදර වලට වැටුනේ? ඇත්තටම කවුද මෙයාල කියල දැනගන්න නම් ඔයාලට මේක බලන්නම වෙනවා.එහෙනම් ඔච්චරයි කියන්න යන්නේ, පැය 1 විනාඩි 56 පුරාවට පට්ට ආතල් සාගරේක කිමිදෙන්න ඔන්නම් මේක අරන් බලන්න සැක හිතන්නැතුව, සුපිරිම ෆයිට් වලින් පිරුණ හොඳ ඇක්ශන් ෆිලුමක් ඔයාලට බලාගන්න හැකිවෙයි.`,
        downloadLink: 'https://t.me/movievresehub/80',
        trailerLink: 'https://www.youtube.com/watch?v=IAdCsNtEuBU&t=11s&pp=ygUHZ2hvc3RlZA%3D%3D',
        gallery: [
            'https://m.media-amazon.com/images/M/MV5BZDNiNWQyZDUtZjVlYS00N2VkLTg2ZDQtZGVlMTMzODEzZjM5XkEyXkFqcGdeQXZ3ZXNsZXk@._V1_.jpg',
            'https://m.media-amazon.com/images/M/MV5BMTcxOGYwMWMtMTNhMi00ZWZlLTg0OWMtNmQyYTE4YzM1MmIzXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRwh3tmoMJYjzovN6RWwIYDlOPqZkKXvVHONH6H6TJWSt1kZq1Ha1ObcabgXDYsmja_-4c&usqp=CAU'
        ]
    },
   
    {
        title: 'Manamey',
        year: '2024',
        genre: ['ROMANCE'],
        rating: '0.0',
        releaseDate: '2024-06-06',
        cast: ['Sharwanand', 'Krithi Shetty', 'Vikram Adhitya', 'Shiva Kandukuri', 'Rahul Ravindran', 'Vennela Kishore', 'Rahul Ramakrishna', 'Ayesha Khan', 'Seerat Kapoor', 'Nellore Sudharshan', 'Sachin Khedekar', 'Tulasi', 'Mukesh Rishi', 'Seetha', 'Thrigun', 'Vijayakumar', 'Zarina Wahab', 'Tanikella Bharani'],
        poster: 'https://m.media-amazon.com/images/M/MV5BMTM4MWZhMDEtZWYzOC00MDE5LThlZGQtZDk2Zjc5Njg0ZDIyXkEyXkFqcGc@._V1_.jpg',
        banner: 'https://i.ytimg.com/vi/3zOCInbXzy8/maxresdefault.jpg',
        englishDescription: `A charismatic playboy's life takes an unexpected turn when a young boy enters his world. Initially causing chaos, the boy gradually becomes an integral part of their lives.

Release Date: 2024-06-06

Rating: 0.0IMDb Logo

Cast
Sharwanand, Krithi Shetty, Vikram Adhitya, Shiva Kandukuri, Rahul Ravindran, Vennela Kishore, Rahul Ramakrishna, Ayesha Khan, Seerat Kapoor, Nellore Sudharshan, Sachin Khedekar, Tulasi, Mukesh Rishi, Seetha, Thrigun, Vijayakumar, Zarina Wahab, Tanikella Bharani`,
        description: `2024 ජූනි 07 වෙනිදා තිරගත වුණු මනමේ කියන අළුත්ම තෙළුගු සිනමාපටයේ උපසිරැසි අරගෙන. මනමේ එහෙමත් නැත්නම් “අපේමයි” කියන තේමාවෙන් එන මේ චිත්‍රපටයට අවාසනාවන්ත ලෙස මුදල් අක්‍රමිකතාවයක් හේතුවෙන් නඩුවක් වැටෙනවා. ඒවගේම කලින් මේ ෆිල්ම් එකේ OTT විකාශන අයිතිය ගන්නේ Disney+Hotstar එකෙන්.. කොහොමින් කොහොමහරි මාස 08කට පස්සේ Amazon Prime වෙතින් පසුගිය මාර්තු 07 වෙනිදා OTT හරහා නිකුත් කෙරුනා.#SHARWA35 හෙවත් චාමිං ස්ටාර් ශ්‍රාවන්ද් රංගනයෙන් දායකවෙන ඔහුගේ 35 වෙනි සිනමාපටයේ වැඩ කටයුතු ආරම්භ කරන්නේ 2023 මාර්තු 06 වෙනිදා ඔහුගේ 39 වෙනි උපන්දිනයට.. (OTT ආවේ 41 වෙනි උපන්දිනේ දවසේ) ඒවගේම චිත්‍රපටයේ රූගතකිරීම් 2024 මුල් භාගය වෙද්දි අවසන් වෙනවා. මේ චිත්‍රපටය ඉන්දියන් එකක් උනාට චිත්‍රපටය රූගත කරන්න ලන්ඩන්, බැංකොක් වලට පවා ගිහින් තියෙනවා කියලා බලාගන්න පුළුවන්.ශ්‍රිරාම් ආදිත්‍යගේ අධ්‍යක්ෂණයෙන් හැඩවෙන මේ චිත්‍රපටය පැය 2යි මිනිත්තු 33 කට ආසන්න ධාවන කාලයක් හිමි වෙනවා. මේ මනමේ ෆිල්ම් එකේ පිරිවැය ගැන සදහනක් නැතත් මෙහි බොක්ස් ඔෆිස් ආදායම ඉන්දියන් රු.කෝටි 22 ආසන්නයි කියලා සදහන් වෙනවා. රොමෑන්ස් – කොමඩි ශානරය යටතේ නිමවෙලා තියෙන මේ ෆිල්ම් එකේ සංගීත අධ්‍යක්ෂනයෙන් දායක වෙලා තියෙන්නේ හෙශාම් අබ්දුල් වහාම්.. නම එතරම් ප්‍රසිද්ධ නොවුනත් මෙයා තමයි ‘හෘදයම්’ , ‘හායි නාන්නා’ චිත්‍රපට වලත් සංගීත අධ්‍යක්ෂනය කරලා තියෙන්නේ.. මේ ෆිල්ම් එකටත් සංගීතය පැත්තෙන් ලොකු බරක් යොදපු ෆිල්ම් එකක්.. හරියටම බැලුවොත් මේ චිත්‍රපටයේ සිංදු 12 ක් තියෙනවා.UK වල ජීවත් වෙන අනුරාග් සහ ශාන්ති හදිසියේම රිය අනතුරකට මුහුන දීලා ඔවුන් දෙදෙනා ජීවිතක්ෂයට පත් වෙනවා. ඉතින් ඒ දෙන්නට හිටියා පුංචි දරුවෙක්. එයා තමයි ‘කුෂි’ ඒවගේම ශාන්ති හිතුවක්කාර කසාදයකට මුල පිරුව නිසා ශාන්තිගේ දෙමව්පියන් (කුෂීගේ ආච්චියි සීයයි) කුෂීව භාරගන්න අකමැත්ත පල කරනවා. ඉතින් භාරකරුවෙක් නැති මේ කුෂීව ළමා නිවාසෙකට යවන එක වළක්වා ගන්න එයාට භාරකරුවෝ දෙන්නෙක් ඉදිරිපත් වෙනවා. එක්කෙනෙක් තමයි සුභද්‍රා.. සුභද්‍රා කියන්නේ ශාන්තිගේ හොදම යාළුවා, ඒවගේම එයා ස්වකැමැත්තෙන් උනත් කුෂීව බලාගන්න ඉදිරිපත් වෙලා ඉන්න කෙනෙක්, අනිත් කෙනා වික්‍රම්.. වික්‍රම් කියන්නේ අනුරාග් ගේ හොදම යාළුවා. ඒ උනාට වික්‍රම්ට තිබුනේ වගකීම් විරහිත සෙල්ලක්කාර ජීවිතයක්. ඉතින් මේ දෙන්නගේ ජීවිත වලට කුෂී ආවම මේ දෙන්නගේ ජීවිත උඩු යටිකුරු වෙනවා.`,
        downloadLink: 'https://t.me/movievresehub/109',
        trailerLink: 'https://www.youtube.com/watch?v=3zOCInbXzy8&pp=ygUUbWFuYW1leSAyMDI0IHRyYWlsZXI%3D',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQJ9iGQaNdF9R9nBb7_UZBgk-iP7nigzhoZ5g&s',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRLCzKSNhCE8XSQge_1b1-tcD1rE2PdQ4ZwRg&s',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTdS2_aiVfzxkTKpCcPaT08Ut-w3vgLBiZ40uINf6T-JktLeenpVKdocBe-pc7nqkVbtiE&usqp=CAU'
        ]
    },
    {
        title: 'Die.Alone',
        year: '2024',
        genre: ['ACTION', 'ADVENTURE'],
        rating: '5.8',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo', 'Kimberly-Sue Murray', 'Jonathan Cherry', 'Amy Matysio', 'Steven Roy', 'Harlan Blayne Kytwayhat', 'Sari Mercer', 'Leo Fafard', 'Laura Abramsen', 'Ryland Alexander', 'Jason Truong', 'Palmer Tastad', 'George Grassick', 'Greyson Dubois'],
        poster: 'https://m.media-amazon.com/images/M/MV5BYjhmMzEzZmItMmEwMy00MDE2LTgxMDYtZGRhY2Q0MmIzYjdjXkEyXkFqcGc@._V1_.jpg',
        banner: 'https://krusade.net/Crossfire/wp-content/uploads/2025/01/BANNER_WIDE_mac_11765683_E2841CA0-68FF-4D56-9E5CF2B24155D8B8.jpg',
        englishDescription: `Lost in a world reclaimed by nature and overrun by mysterious creatures, Ethan, a young man with amnesia navigates the dangerous landscape in search of his lost love Emma. His journey takes an unexpected turn when he encounters Mae, a hardened and eccentric survivor. Together, Ethan and Mae face threats both human and otherwise before a fateful encounter with Kai unravels a secret that lies just beyond Ethan's fractured memory.

Release Date: 2024-09-27

Rating: 5.8IMDb Logo

Cast
Carrie-Anne Moss, Douglas Smith, Frank Grillo, Kimberly-Sue Murray, Jonathan Cherry, Amy Matysio, Steven Roy, Harlan Blayne Kytwayhat, Sari Mercer, Leo Fafard, Laura Abramsen, Ryland Alexander, Jason Truong, Palmer Tastad, George Grassick, Greyson Dubois`,
        description: `සැබෑ ආදරය, උත්තරීතර ප්‍රේමය ගැන කතාන්දර ඔයාල කොච්චරවත් අහලා ඇති. නාට්‍ය වල, චිත්‍රපටවල දැකල ඇති. පොත්වල කියවලත් ඇති. නමුත් සැබෑ ලෝකයේ දුර්ලභ, ඒ උතුම් ආදරය ගැන නව මානයකින් ඉදිරිපත් කල අනුවේදනීය කතාවක් රැගත් සොම්බි ආකාරයේ කැනේඩියානු චිත්‍රපටයක් පසුගිය 2024 ඔක්තෝබර් 18 දින ඩිජිටල් මාධ්‍යයෙන් සහ සැප්තැම්බර් 27 දින කැනඩාවේදී සිනමාශාලාවලදී නිකුත්වුනා. ඒ තමයි ටොමැටෝ මීටරය 75% දක්වා කරකවන්නට සමත්වූ Die Alone. භාෂාව ඉංග්‍රීසි. විනාඩි 91 ක ධාවන කාලයකින් යුතු මෙය Zombie Horror, Drama, Mystery & Thriller වර්ගයේ චිත්‍රපටයක්. කතාව සහ අධ්‍යක්ෂනය Lowell Dean ගෙන්. ප්‍රධානම භූමිකාව වන ‘මේ’ගේ චරිතයට පණ පොවන්නෙ Matrix සිනමා ත්‍රිත්වයෙන් ඔබ හමුවට ආ Carrie-Anne Moss. ඊට අමතරව රංගනයෙන් එකතුවෙනවා Douglas Smith (ඊතන්), Frank Grillo (කායි) සහ Kimberly-Sue Murray (එමා).වයිරසයක් නිසා මිනිසුන් වඳවී යාමේ තර්ජනයකට ලක්වී ඇති කාලයක්. ආසාදනය වූවන් මරණෙන් නැගිටිනවා. ඔවුන්ගේ ඇඟේ අතු ඇවිත් ඔවුන් ඇවිදින ශාක බවට පත්වෙනවා. හරියට සොම්බිලා වගේ මිනී මස්මයි හොයන්නෙ. අපේ කතා නායකයා වන ඊතන් එක පාරටම නින්දෙන් නැගිටිනවා වාහනයක් ඇතුලෙදි. ඔහු සමඟ සිටි ඔහුගේ පෙම්වතිය වන එමාට උනු දෙයක් නෑ. තමා ඉන්නෙ කොහෙද කියල අදහසක්වත්, වුනේ මොකක්ද කියල මතකයක්වත් නෑ ඔහුට නෑ. ඔහු අමතකවීමේ රෝගය තියෙනවා. ඔහුව දකින දෙන්නෙක් ඔහුව මරන්න හදනකොට එක්තරා මැදිවියේ කාන්තාවක් ඔහුව බේරාගන්නවා. ඇය වසංගත තත්ත්වයට බුද්ධිමත්ව සහ සැලසුම් සහගතව මූණ දෙන කෙනෙක්. එමාව හම්බවෙන ඊතන්ට උදව් කරන්න මේ කාන්තාව එකඟවෙනවා. මොකද එයාල වෙන්වුනොත් කැන්ඩ්ල් ලේක්හී එයාලගෙ කැබින් එකකදී හමුවෙන්න ඔවුන් කතා වෙලා තියෙන නිසා. මේ අමනුෂ්‍යයින්ගෙන් බේරිලා එතන්ට යන්න ඊතන්ට හැකි වෙයිද? ගියත් එමා…..? ඉතිරි ටික චිත්‍රපටයෙන් බලමු නේද?`,
        downloadLink: 'https://t.me/movievresehub/101',
        trailerLink: 'https://www.youtube.com/watch?v=0FSwsrFpkbw&pp=ygUJYmFsbGVyaW5h',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRoc2NA_zk6fvtDbOolA3QL8CWRm_EFZSJPCw&s',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT3js1OWNYYO2M-sAXFB2KZ60nKoilQ_3DG4JMY-pa1wXjdAiHS41-4heePWNZQrLFoYdw&usqp=CAU',
            'https://loudandclearreviews.com/wp-content/uploads/2024/10/die-alone-header-1024x512.webp'
        ]
    },
    {
        title: 'Red Notice',
        year: '2021',
        genre: ['ACTION', 'ADVENTURE'],
        rating: '6.8',
        releaseDate: '2021-11-04',
        cast: ['Dwayne Johnson', 'Ryan Reynolds', 'Gal Gadot', 'Ritu Arya', 'Chris Diamantopoulos', 'Ivan Mbakop', 'Vincenzo Amato', 'Rafael Petardi', 'Seth Michaels', 'Sebastien Large', 'Guy Nardulli', 'Andrew Hunter', 'George Tsai', 'Rawson Marshall Thurber', 'Robert Mata', 'Anthony Belevtsov', 'Daniel Bernhardt', 'Yosef Podolski', 'Martin Harris', 'Alexander Perkins', 'Joseph A. Garcia', 'Gonzalo Escudero', 'Jay Romero', 'Ethan Herschenfeld', 'Brenna Marie Narayan'],
        poster: 'https://m.media-amazon.com/images/M/MV5BOGNjNGQ3MmItYTM5NS00NjBiLWI0ZTItZDE5ZjQyNjg3ODBjXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg',
        banner: 'https://ucsdguardian.org/wp-content/uploads/2021/11/Red-Notice-courtesy-of-Netflix.jpeg',
        englishDescription: `An Interpol-issued Red Notice is a global alert to hunt and capture the world's most wanted. But when a daring heist brings together the FBI's top profiler and two rival criminals, there's no telling what will happen.

Release Date: 2021-11-04

Rating: 6.8IMDb Logo

Cast
Dwayne Johnson, Ryan Reynolds, Gal Gadot, Ritu Arya, Chris Diamantopoulos, Ivan Mbakop, Vincenzo Amato, Rafael Petardi, Seth Michaels, Sebastien Large, Guy Nardulli, Andrew Hunter, George Tsai, Rawson Marshall Thurber, Robert Mata, Anthony Belevtsov, Daniel Bernhardt, Yosef Podolski, Martin Harris, Alexander Perkins, Joseph A. Garcia, Gonzalo Escudero, Jay Romero, Ethan Herschenfeld, Brenna Marie Narayan`,
        description: `විවිධ විවේචන සහ ඇගයීම් මධ්‍යයේ, හොඳ සාර්ථකව තිරගත වෙන චිත්‍රපටියක් විදියට මේක නම් කරන්න පුළුවන්. සාමාන්‍යයෙන් Dwayne Johnson ගේ චිත්‍රපටියක් කියන්නේම ප්‍රේක්ෂක ආකර්ෂණය නිතැතින්ම ලැබෙන එකක්. ඒ නිසාමදෝ, චිත්‍රපටිය ගැන හැමෝම කියන්නේ හොඳ. Ratings අතින් ගත්තත් හොඳ මට්ටමක තියෙනවා. මේ ලිපිය ලියනකොට, IMDB 6.4, Google Users 88% ක් මේකට කැමැත්ත ප්‍රකාශ කරලා තිබ්බා.Rawson Marshall Thurber විසින් අධ්‍යක්ෂණය කරපු මේ චිත්‍රපටියේ කතාවත් ඔහුගේම නිර්මාණයක්. වෙනස් විදියේ කතාවක් යොදාගත්තත්, ‍තේමාව සාමාන්‍ය ඇමරිකානු චිත්‍රපටි කතාවක් කියලා සමහර අය චෝදනා කරනවා. චිත්‍රපටියට යොදාගත්ත නළු නිළි කණ්ඩායම නම් අති විශිෂ්ඨයි. මේ චිත්‍රපටියේ රඟපෑමෙන් දායක වෙනවා Dwayne Johnson (ජෝන් හාට්ලි), Ryan Reynolds (නෝලන් බූත්), Gal Gadot (බිෂොප්) සහ Ritu Arya (ඉන්ස්පෙක්ටර් දාස්) එක්වෙනවා.කතාව ගැන කෙටියෙන් කිව්වොත්, අන්තර්ජාතික පොලිසිය කලා කෘති හොරකමක් පසුපස්සේ යනවා. ඒ ක්ලියෝපැට්‍රාට අයිතිව තිබුණු බිත්තර තුනක් හොයාගෙන. මේ වෙලාවේ ඒවා හොරකම් කරන්න තවත් දෙදෙනෙක් යොමුවෙලා. වැඩිය කතා නැතිව, මේ චිත්‍රපටිය නරඹන්න. රසවිඳින්න!!`,
        downloadLink: 'https://t.me/movievresehub/101',
        trailerLink: 'https://www.youtube.com/watch?v=0FSwsrFpkbw&pp=ygUJYmFsbGVyaW5h',
        gallery: [
            'https://images.lesindesradios.fr/fit-in/1100x2000/filters:format(webp)/radios/latina/importrk/news/original/58690.jpeg',
            'https://dnm.nflximg.net/api/v6/BvVbc2Wxr2w6QuoANoSpJKEIWjQ/AAAAQf3e5D1GqciYsIibhZXtgvZWTtPAeVsM2nGpl5PNXvu0BuwEV0aX5NaYOtuvoHCv2lyKdpETbXhZjtTeqPVC4T01CCNEmgjPA7FZtk5u-4CXzQHwdyn_nKdw0a9_4WERMkL_lOvUvLaV8jEzP95Pbz5sBqA.jpg?r=3e8',
            'https://dnm.nflximg.net/api/v6/BvVbc2Wxr2w6QuoANoSpJKEIWjQ/AAAAQdsXct6vXbMp6OmlmqaD5PR1B4tPPd32Fkg7A3FLzIgdJ05VL1DdMMUdW6HH_UFDs4Kbcg_xdk_tHbxsNtVL71yeR8syE42bF6zFAXGvfCZnxwiNU7FDGc-fVP9q8v2LpOo237-DYKyVRpVRCti6uNsW.jpg?r=939'
        ]
    },
    {
        title: 'Kill',
        year: '2024',
        genre: ['ACTION', 'ADVENTURE'],
        rating: '4.9',
        releaseDate: '2024-09-06',
        cast: ['Daniel Portman', 'Brian Vernel', 'Calum Ross', 'Paul Higgins', 'James Harkness', 'Joanne Thomson', 'Anita Vettesse'],
        poster: 'https://s3.amazonaws.com/nightjarprod/content/uploads/sites/130/2024/05/23122308/Kill_2000x3000_legal_V2-scaled-1.jpeg',
        banner: 'https://maactioncinema.com/wp-content/uploads/2024/07/MV5BNmNmMzczYjEtOTg1NC00MDk1LTk3NjYtNjQwZGNlN2JjM2I1XkEyXkFqcGc@._V1_.jpg',
        englishDescription: `The story centres on three brothers and their violent father who live in a remote forest. The brothers attempt to kill their father while on a hunting expedition but this instead begins a deadly game of cat-and-mouse.

Release Date: 2024-09-06

Rating: 4.9IMDb Logo

Cast
Daniel Portman, Brian Vernel, Calum Ross, Paul Higgins, James Harkness, Joanne Thomson, Anita Vettesse`,
        description: `ඉන්දියන් Action ෆිල්ම් එකක් කිව්වොත් එකක් ගහපු ගමන් අඩි 10ක් විතර විසි වෙන එක්කෙනෙක් එකතුවෙලා සේනාවකටම ගහන ෆිල්ම් නේද ගොඩක් දෙනාට මතක් වෙන්නෙ..එහෙමනම් ඔයා බලන්නම ඕන ෆිල්ම් එකක් තමයි මේක..පැයයි විනාඩි 45 කට ආසන්න කාලයක් දුම්රියක් ඇතුලෙ සිදුවෙන අති සුපිරි ඇක්ෂන් ටිකක් බලාගන්න ලැබෙයි..ගොඩක් දෙනා රිලීස් වෙනකන් නොයිවසිල්ලෙන් බලාගෙන ඉදපු KILL කියන සුපිරිම Action ෆිල්ම් එක. මේ ෆිල්ම් එක ගැන කියනවනම් ගොඩක්ම හොද ප්‍රතිචාර තමයි ෆිල්ම් එකට ලැබිලා තියෙන්නෙ..ඒ වගේම IMDB දර්ශකයෙත් ඉහල අගයක් (8/10) ලබාගන්න මේ ෆිල්ම් එක සමත් වෙලා තියෙනවා.ඒ වගේම කියන්න ඕනෙ මේ ෆිල්ම් එක තමයි ඉන්දියාව එතෙක් මෙතෙක් හදපු ප්‍රචණ්ඩත්වය වැඩිම ෆිල්ම් එක.. ඔව් ඒ කියන්නෙ ලේ / කපන කොටන සීන් බලන්න වැඩි කැමැත්තක් නැති කෙනෙක්ටනම් මේක ටිකක් එපා වෙයි..ඉතින් ෆිල්ම් එක දිහාට ගියොත්..ෆිල්ම් එකට රංගනයෙන් දායක වෙන ප්‍රධාන නලුවා තමයි lakshya කියන නළුවා..ඔයාලා එයාව දන්නවා ඇති සිරසේ දිග්විජය කියන නමින් විකාශනය උන ඉන්දියානු කතා මාලාවෙ පෝරස්ගෙ චරිතයට රංගනයෙන් දායක උනේ මෙයා. ඒ වගේම මේ ෆිල්ම් එක ඉන්දියානු රසිකයො අතර වගේම U.S වල රසිකයො අතරත් සෑහෙන්න ප්‍රසිද්ධ උනා..ඒ වගේම මේ ෆිල්ම් එකට බොක්ස් ඔෆිස් වලත් හොද සාර්තකත්වයක් ලගා කරගන්න පුලුවන් උනා. ගොඩක් U.S රසිකයො මේ ෆිල්ම් එක නම් කරලා තිබුණෙ ජෝන් වික් වල ඉන්දියන් version එක කියලා..ඉතින් ඒකෙන්ම ඔයාලට හිතාගන්න පුලුවන්නෙ මේ ෆිල්ම් එකේ කොයිතරම් කොලිටි ඇක්ෂන් බලාගන්න පුලුවන් වෙයිද කියලා..ෆිල්ම් එකේ කතාව ගැනනම් මම කිසිම දෙයක් කියන්න යන්නෙ නෑ..දුම්රියක් ඇතුලෙ සිදුවන ක්‍රියාධාම පෙලක් ඇතුලත් මේ ෆිල්ම් එක පැය 1 යි විනාඩි 45 ක පමන කාලයක් ධාවනය වෙනවා..මේ කාලය ඇතුලෙ ඔයාලට next level Action / blood scene වගේ ගොඩක් දේවල් බලාගන්න පුලුවන්..ලේ දකින්න ටිකක් අකමැති සංවේදී කෙනෙක්නම් මම ආයෙ කියනවා මේක බලන්න කලින් දෙපාරක් හිතලා බලන්න😉`,
        downloadLink: 'https://t.me/movievresehub/97',
        trailerLink: 'https://www.youtube.com/watch?v=cVyNeDYu9Kk&pp=ygUEa2lsbA%3D%3D',
        gallery: [
            'https://variety.com/wp-content/uploads/2023/09/Kill1.jpg?w=1000&h=563&crop=1',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSBhYNJ9g9O_rrXcJZwJAlhRvA9snOElxpfbQ&s',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT9nuEC3qZ_UsN5J4tTFcviLmWXQBmcQho2fAByhyfgn76KGNQNxOQMl5Z8D71hKGhcwIU&usqp=CAU'
        ]
    },
    {
        title: 'Alarum',
        year: '2025',
        genre: ['ACTION', 'ADVENTURE'],
        rating: '5.8',
        releaseDate: '2025-01-16',
        cast: ['Scott Eastwood', 'Sylvester Stallone', 'Willa Fitzgerald', 'Mike Colter', 'D.W. Moffett', 'Isis Valverde', 'Joel Cohen', 'Mark Polish', 'Anton Narinskiy', 'Patrick Millin', 'La Monde Byrd', 'Beau Bommarito', 'Bret Aaron Knower', 'John E. Brownlee', 'Derek Polen', 'Kevin W. Shiveley', 'John W. Harden', 'Leslee Emmett', 'Abigail Spear', 'Vasilios Viores', 'Ken Strunk', 'Bailey Edwards', 'Jocelyn Devilliers'],
        poster: 'https://m.media-amazon.com/images/M/MV5BOWFmNDZmNDUtYjVlOC00ZWQyLWFmZGQtMTkzZDY5ZjZmNzJkXkEyXkFqcGc@._V1_.jpg',
        banner: 'https://image.tmdb.org/t/p/original//oWLjJH04wcBMkpfjKPEbPKgUSRY.jpg',
        englishDescription: `Two married spies caught in the crosshairs of an international intelligence network will stop at nothing to obtain a critical asset. Joe and Lara are agents living off the grid whose quiet retreat at a winter resort is blown to shreds when members of the old guard suspect the two may have joined an elite team of rogue spies, known as Alarum.

Release Date: 2025-01-16

Rating: 5.8IMDb Logo

Cast
Scott Eastwood, Sylvester Stallone, Willa Fitzgerald, Mike Colter, D.W. Moffett, Isis Valverde, Joel Cohen, Mark Polish, Anton Narinskiy, Patrick Millin, La Monde Byrd, Beau Bommarito, Bret Aaron Knower, John E. Brownlee, Derek Polen, Kevin W. Shiveley, John W. Harden, Leslee Emmett, Abigail Spear, Vasilios Viores, Ken Strunk, Bailey Edwards, Jocelyn Devilliers`,
        description: `ආයුබෝවන් කියන ගමන් අදත් මන් අරගෙන ආවේ ලස්සන ෆිල්ම් එකක් , ගොඩක්ම ඇක්ෂන් වලට බර ගොඩක් අය දන්නා නළුවන් තුන්දෙනෙක් මේකේ ඉන්නවා.කතාව ගැන කෙටියෙන් කියනවා නම් ඔත්තුකරුවන්  දෙන්නෙක් ගැන තමයි කතාව යන්නේ මේ දෙන්නා එලියට ඇවිල්ලා දෙයක් හොයනවා යනවා මෙයාලාගේ පස්සෙන් සැහෙන පිරිසක් එනවා , ඉතින් විස්තර එක්කම දැනගන්න ෆිල්ම් එක බලමු`,
        downloadLink: 'https://t.me/movievresehub/95',
        trailerLink: 'https://www.youtube.com/watch?v=_6dlIjZjFq4&pp=ygUNYWxhcnVtICgyMDI1KQ%3D%3D',
        gallery: [
            'https://m.media-amazon.com/images/M/MV5BNTE2ZmYwODgtZTdkNS00OTk3LTk1ODUtYjUzZmZlMWYyYWQ3XkEyXkFqcGc@._V1_.jpg',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcReUogchXuh0l9H0Li4S_CSx0LYUfmrLbuWyM7IT9IIWrxp8KYlfB0lgyDARfr_9vcfAHk&usqp=CAU',
            'https://cdn.kinocheck.com/i/w=480/tiuqqhekdz.jpg'
        ]
    },
    {
        title: 'Hide N Seek',
        year: '2024',
        genre: ['CRIME'],
        rating: '0.0',
        releaseDate: '2024-09-20',
        cast: ['Tejaswi Madivada', 'Sumanth', 'Dayanand Reddy', 'Shilpa Manjunath', 'Rhea Sachdeva', 'Rohith Addanki', 'Viswant Duddumpudi', 'Akella Raghavendra', 'Sridhar Reddy', 'Saakshi Siva', 'Sainath Garimella'],
        poster: 'https://images.plex.tv/photo?size=large-1920&scale=1&url=https%3A%2F%2Fimage.tmdb.org%2Ft%2Fp%2Foriginal%2FcYSekNhfPK3bMnkgBQAmMSBlMsm.jpg',
        banner: 'https://sund-images.sunnxt.com/211393/640x360_HideNSeek_211393_1dd9680e-fc50-4798-901c-a8c0205b708f.jpg',
        englishDescription: `When a chilling pattern emerges, Vaishnavi's relentless pursuit of justice leads her to uncover a sinister pattern connecting the seemingly unrelated murders. Anonymous Warnings As the investigation intensifies, Vaishnavi receives another cryptic file, predicting yet another murder on the horizon. Race Against Time Racing against the clock, Vaishnavi follows leads to the latest crime scene, discovering an unimaginable tragedy that shatters Shiva's world. With every twist and turn, the narrative spirals into a labyrinth of hidden motives, hidden alliances, and buried secrets.

Release Date: 2024-09-20

Rating: 0.0IMDb Logo

Cast
Tejaswi Madivada, Sumanth, Dayanand Reddy, Shilpa Manjunath, Rhea Sachdeva, Rohith Addanki, Viswant Duddumpudi, Akella Raghavendra, Sridhar Reddy, Saakshi Siva, Sainath Garimella`,
        description: `crime ගනයට අයත් වෙන මේ ෆිල්ම් එක අද්‍යක්ෂනය කරල තියෙන්නේ Basireddy Rana විසින් ඒ වගේම Viswant Duddumpudi ශිවා විදියට මෙහි රංගනයෙන් දායක වෙනවා. මීට අමතරව Rhea Sachdeva, Shilpa Manjunath, Tejaswi Madivada, Dayanand Reddy මෙහි රන්ගනයෙන් දායක වෙනවා.කතාව පැත්තට ගියොත් ශිවා කියන්නේ මෙඩිකල් කොලේජ් එකේ ඉගන ගන්න වෛද්‍ය ශිෂ්‍යයෙක් ඉතින් මේ අතරෙ තමයි ශිවාගෙ යාලුවෙක් උන චන්දූ හදිස්සියේම කොලේජ් එකේ බිල්බිමක් උඩින් පැනල මැරෙන්නේ. පොලිසිය මේක සිය දිවි හානිකර ගැනීමක් කියල හිතුවත් ශිවා මේක ගැන හොයන්න ගන්නව. එතකොට තමයි ශිවාට කරදර වගේකට මුහුණ දෙන්න වෙන්නේඉතින් මේ ශිවා කියන්නෙ කවුද? ඇත්තටම චන්දුගෙ මරණය දිවි නසාගැනීමක්ද? කවුද මේ මරණ පිටිපස්සෙ ඉන්නේ මේව දැනගන්නනම් කතාව බලන්නම වෙනව.`,
        downloadLink: 'https://t.me/movievresehub/93',
        trailerLink: 'https://youtu.be/ISEXzKlshB8?si=oMGjahcb0Q_wGmcZ',
        gallery: [
            'https://images.plex.tv/photo?size=large-1920&scale=1&url=https%3A%2F%2Fimage.tmdb.org%2Ft%2Fp%2Foriginal%2Fe4P0VQmLHAaXjTEyjh9gWlkckTU.jpg',
            'https://blog.reelgood.com/wp-content/uploads/2025/01/hsdnsd-scaled.jpg',
            'https://i.ytimg.com/vi/ISEXzKlshB8/maxresdefault.jpg'
        ]
    },
    {
        title: 'Purushothamudu',
        year: '2024',
        genre: ['ACTION'],
        rating: '0.0',
        releaseDate: '2024-07-26',
        cast: ['Raj Tarun', 'Hassini Sudhir', 'Ramya Krishnan', 'Prakash Raj', 'Brahmanandam', 'Murali Sharma', 'Brahmaji', 'Raj Tirandasu', 'Viran Muttamsetty', 'Kausalya', 'Racha Ravi', 'Praveen', 'Sameer Hasan', 'Satya', 'Raja Ravindra', 'Kavitha', 'Mukesh Khanna', 'Mukhtar Khan', 'Stun Siva', 'Laxman Meesala'],
        poster: 'https://m.media-amazon.com/images/M/MV5BMjliM2EzYTMtNzc5Ni00N2IwLTg0NzMtYmY2NTA1ZjU4YWZjXkEyXkFqcGc@._V1_QL75_UY281_CR18,0,190,281_.jpg',
        banner: 'https://img.nowrunning.com/content/movie/2024/purus-29884/bg_purushothamudu.jpg',
        englishDescription: `Rachit Ram, heir to a multi-billion-dollar corporate conglomerate, sets off on his journey to fulfill a daunting challenge of living like a commoner for 100 days in the middle of nowhere with absolutely no money and privileges, while his aunt and cousin brother conspire together to make him fail his challenge.

Release Date: 2024-07-26

Rating: 0.0IMDb Logo

Cast
Raj Tarun, Hassini Sudhir, Ramya Krishnan, Prakash Raj, Brahmanandam, Murali Sharma, Brahmaji, Raj Tirandasu, Viran Muttamsetty, Kausalya, Racha Ravi, Praveen, Sameer Hasan, Satya, Raja Ravindra, Kavitha, Mukesh Khanna, Mukhtar Khan, Stun Siva, Laxman Meesala`,
        description: `ඉතින් අපේ කතාවේ කතා නායකයා රාම්. මයා ලොකු බිස්නස් එකක CEO කෙනෙක්ගේ පුතෙක්. මෙය පොඩි කාලේ ඉදන්ම හැදෙන්නේ ලන්ඩන් වල . තාත්තගෙන් පස්සේ ඒ කම්පැනි එකේ ඊලග CEO වෙන්න තමි මේ රාම් එන්නේ. එත් ආවට පස්සේ එතන පොඩි අවුලක් වෙනවා. අවුල තමයි මේ කම්පැනි එකේ නීතියක් තියෙනවා CEO වෙනවා නම් සාමාන්‍ය මිනිහෙක් විදිහට දවස් 100ක් වෙනම ජිවත් වෙන්න ඕන , සියලු සම්පත් අතැරලා දාලා..ඉතින් රාම් මේ අභියෝගය භාරගනියිද? CEO වෙන්න පුළුවන් වෙයිද ? නැත්නම් අපහු ලන්ඩන් වලට යයිද? එක දන ගන්න නම් ඔයා ඔයා මේ ලස්සන ෆිල්ම් එක බලන්නම වෙනවා..`,
        downloadLink: 'https://t.me/movievresehub/91',
        trailerLink: 'https://www.youtube.com/watch?v=4ihYCQVvrow&t=18s&pp=ygUVcHVydXNob3RoYW11ZHUgKDIwMjQp',
        gallery: [
            'https://i.ytimg.com/vi/lZJmfZJCYro/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLA89byX_aLXSzjzazco2SzotLHBpA',
            'https://www.koimoi.com/wp-content/new-galleries/2024/08/purushothamudu-ott-release-where-when-to-watch-raj-tharuns-telugu-action-film.jpg',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRu0u6x3S3tIX7SZhMNB7oVenKbtvw_JVNNOg&s'
        ]
    },
    {
        title: 'Carry-On',
        year: '2024',
        genre: ['ACTION'],
        rating: '6.1',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo'],
        poster: 'https://upload.wikimedia.org/wikipedia/en/thumb/d/d0/Carry_On_film_poster.jpg/250px-Carry_On_film_poster.jpg',
        banner: 'https://image.tmdb.org/t/p/w1280/6RcBQkC2PZJwwbFugqzgvN3moYL.jpg',
        englishDescription: `An airport security officer races to outsmart a mysterious traveler forcing him to let a dangerous item slip onto a Christmas Eve flight.

Release Date: 2024-12-05

Rating: 6.9IMDb Logo

Cast
Taron Egerton, Jason Bateman, Sofia Carson, Danielle Deadwyler, Theo Rossi, Logan Marshall-Green, Dean Norris, Sinqua Walls, Gil Perez-Abraham, Tonatiuh, Curtiss Cook, Joe Williamson, Josh Brener, Benito Martinez, Edwin Kho, Reisha Reynolds, Adam Stephenson, Michael Scott, Jeff Pope, Raymond Rehage, Nico Bucher, Jill Flint, Kenneth Nance Jr., Spencer Crim, Martina Meneses`,
        description: `ලොස් ඇන්ජලීස් ගුවන්තොටුපොල කියන්නේ නත්තල් සැන්දෑවේ අතිශයින්ම කාර්යබහුල වෙන තැනක්. කිසියම් කඩාකප්පල්කාරී කණ්ඩායමක් සූදානම් වෙනවා, මේ නත්තල් දවසේ, භයානක ප්‍රහාරයක් දියත් කරන්න. මේකේ ඉලක්කය කවුද කියලා දැනගන්න වෙන්නේ අන්තිමට. හැබැයි, මේ ප්‍රහාරය කරන්න සැලසුම් කරන්නේ හරිම අමුතු විදියකට. විවිධ මට්ටමේ කල්ලි මේ මෙහෙයුමට සම්බන්ධ වෙලා. මේක නවත්තන්න උත්සාහ දරන්නේ, අපි කවුරුවත් හිතන්නේ නැති අය. මේ ගැන දැනගන්න, මේ චිත්‍රපටිය බලන්න වෙනවා.Carry-On (2024) ඇමරිකානු චිත්‍රපටිය අධ්‍යක්ෂණය කරන්නේ ස්පාඤ්ඤ චිත්‍රපටි අධ්‍යක්ෂකවරයෙක් වෙන Jaume Collet-Serra. T.J. Fixman විසින් රචනා කරපු කතාවක් තමයි මෙයා සිනමාවට නගන්නේ. ගොඩාක් හොඳ චිත්‍රපටි වගේම මේකත් ලොව පුරා බෙදා හරින්නේ Netflix ආයතනය. රඟපෑමෙන් දායක වෙනවා, Taron Egerton (ඊතන්), Jason Bateman (මඟියා), Sofia Carson (නෝරා පෙරිසි), Danielle Deadwyler (එලීනා) ඇතුළු පිරිසක්.Web ratings ගැනත් කියන්න හිතු‍වේ, හැමෝම මුලින් බලන්නේ මේවා ගැන නිසා. මේ ලිපිය ලියන මොහොතේදී, IMDb 6.5, Rotten Tomatoes 88%, Metacritic 68%, Google Users 87% තම කැමැත්ත ප්‍රකාශ කරලා තියෙනවා.චිත්‍රපටිය ගැන විස්තර හොයද්දී හමුවුන කතාවක් මේ. 1970දී තිරගත වුණු Airport නම් චිත්‍රපටියේ අවසානයේදී ගුවන්යානයක් පුපුරවා හරිනවා. මේ ගුවන්යානය අයිති සමාගම විදියට චිත්‍රපටියේ සඳහන් වුනේ, ට්‍රාන්ස්-ග්ලෝබල් විදියට. මේ චිත්‍රපටියේත් මේ සිද්ධියට භාජනය වෙන ගුවන් යානා වලින් එකක් ඒ සමාගමටම අයිති විදියටයි සඳහන් වෙන්නේ. මේ අතීතයේ ඒ චිත්‍රපටිය ආවර්ජනය කිරීමක් විදියටයි හැමෝම දකින්නේ.`,
        downloadLink: 'https://t.me/movievresehub/89',
        trailerLink: 'https://www.youtube.com/watch?v=KS0XacjMmOc&pp=ygUXY2Fycnktb24gKDIwMjQpIHRyYWlsZXI%3D',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRrrawFAY8d39tS8Yt25wv8XUf2UjzrFPS6XA&s',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT1QSoTfe2FSb0zo_JS3XIXUctwZh-G6ZgQL0I65hgoGa_Jlg6pqJ4zJj1_bvUQuYCoz1I&usqp=CAU',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQqqzml3HUMSdN8eOEe6MfPmN906-7O_c3lJw&s'
        ]
    },
    {
        title: 'Marco',
        year: '2024',
        genre: ['ACTION'],
        rating: '6.1',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo'],
        poster: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS72KJFiJzCc5ta0lc94einqCyJSfm2Jw-Zhg&s',
        banner: 'https://img.nowrunning.com/content/movie/2024/marco-28691/bg-video102202340946.jpg',
        englishDescription: `An airport security officer races to outsmart a mysterious traveler forcing him to let a dangerous item slip onto a Christmas Eve flight.

Release Date: 2024-12-05

Rating: 6.9IMDb Logo

Cast
Taron Egerton, Jason Bateman, Sofia Carson, Danielle Deadwyler, Theo Rossi, Logan Marshall-Green, Dean Norris, Sinqua Walls, Gil Perez-Abraham, Tonatiuh, Curtiss Cook, Joe Williamson, Josh Brener, Benito Martinez, Edwin Kho, Reisha Reynolds, Adam Stephenson, Michael Scott, Jeff Pope, Raymond Rehage, Nico Bucher, Jill Flint, Kenneth Nance Jr., Spencer Crim, Martina Meneses`,
        description: `ආයුබෝවන් හැමෝටම ඔන්න එහෙනන් අද අරගෙන ආවා නත්තල් තෑග්ගක් මේක ගිය සතියෙ නිකුත් උනු Marco 2024 මලයාලම් චිත්‍රපටය මේක ගැන ගොඩාක් අය දන්නවත් ඇති.බලමුද එහෙනන් ඉන්දියානු සිනමා ඉතිහාසයේ සාහසිකම චිත්‍රපටය ?? ඔව් ඇයි මං මලයාලම් සිනමාවේ කියලා නොකියා ඉන්දියානු සිනමාවෙ කියලා මොකද ඉන්දියාවෙ තියා ඇමෙරිකාවෙවත් මෙච්චර හිතට දැනෙන මොකක්ද මේ උනේ මොකක්ද මං බැලුවෙ කියලා හිතෙන දවස් ගානක් යනකල් සීන් අමතක වෙන්නැති මේ වගේ ෆිල්ම් එකක් නිසා මේක බලද්දි හිතුනා මේ සීන් ටික කරන්න අවසර ලැබුනද කියලත් මට හිතාගන්න බැහැ මේක ටයිප් කරන වෙලාවෙත් මැවිලා පේනවා එච්චරටම ඔලුව විකාර වෙලා ගියා මේක නිසා….මචන් මෙහෙම ඒවා මම film එකක දැකලා නෑ.. සිරාවටම! ඇමරිකාවේ වෙනම gore ෆිල්ම්ස් හැදෙනවා තමයි, ඒත් ඒවල ඇගට කිසි දැනීමක් නෑනේ? ඔහේ පටන් ගත්ත වෙලේ ඉදං කපනවා. හැබැයි මේක එහෙම නෙමේ.. ඒ සීන්ස් දැනෙනවා උන්නි මුකුන්දන් තමයි මේක නිෂ්පාදනය කරන්නෙ ඇක්ටින්ග් සහ Killng Sence Next Level එකට තිබ්බා.ඒවගේම කියන්න ඕනේ, Typical Mass Films වල තියෙන Cringe ඩයලොග්, සිදුවිය නොහැකි දේවල් එමටයි. රත්තරන් industry එකේ, crime පවුල් දෙකක් අතර සිද්ද වෙන fight එකක් තියෙන්නේ..යාලුවනෙ පුංචි අය එක්කනම් කීයටවත් මේක බලන්න එපා මේකට 18± කැටගරිය දෙන්නම ඕනෙ මේක Violence Movie එකක් නිසා අසභ්‍ය දර්ශන නැති උනත් දරුවෙක්ට තියා වැඩිහිටියෙක්ටවත් දරාගන්න බැරි දර්ශන තියෙනවා ෆර්ස්ට් හාල්ෆ් එක ටිකක් ඇදගෙන යනවා දෙවෙනි හාල්ෆ් එක පටන් ගත්ත වෙලේ ඉඳන් ඇනකොටාගැනිල්ලක් තමයි තීන්නෙ මම මේ වගේ චිත්‍රපටයක්නම් කවදාවත් දැකලා නැහැ දකියි කියලා බලාපොරොත්තු උනෙත් නැහැ ආයෙ කියනවා පොඩි අය එක්ක බලන්න එපා.එහෙනන් හැමෝම බලන්නකෝ ඉන්දියානු සිනමා ඉතිහාසයෙම සාහසිකම චිත්‍රපටය…`,
        downloadLink: 'https://t.me/movievresehub/87',
        trailerLink: 'https://www.youtube.com/watch?v=uc3mlFD-lFQ&pp=ygUMbWFyY28gKDIwMjQp',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSJAdEHHNw53NZdS-PqPlvCBnjSW-6zbww0Cg&s',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR5mOFsiZKgFx45xf1hac10CBg8GbazugWF-ViMwas75-5jD5BIAIEL98JeW2VEpRL7MCA&usqp=CAU',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRlVpbLsrlYfJVBN9CnDdLYIld1Ibsi_dPkV-2t4yYZnC7qmTCs906qaevo_tR3tzaecXA&usqp=CAU'
        ]
    },
    {
        title: 'Zebra',
        year: '2024',
        genre: ['ACTION'],
        rating: '6.1',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo'],
        poster: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTBd7GE-MbTxxtuLcAMecRUUOeE9O3N5PWJYg&s',
        banner: 'https://i.ytimg.com/vi/TkvMafRQXEM/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLBQHLBdxf2tu1xNERYEecKrHOgNyg',
        englishDescription: `An airport security officer races to outsmart a mysterious traveler forcing him to let a dangerous item slip onto a Christmas Eve flight.

Release Date: 2024-12-05

Rating: 6.9IMDb Logo

Cast
Taron Egerton, Jason Bateman, Sofia Carson, Danielle Deadwyler, Theo Rossi, Logan Marshall-Green, Dean Norris, Sinqua Walls, Gil Perez-Abraham, Tonatiuh, Curtiss Cook, Joe Williamson, Josh Brener, Benito Martinez, Edwin Kho, Reisha Reynolds, Adam Stephenson, Michael Scott, Jeff Pope, Raymond Rehage, Nico Bucher, Jill Flint, Kenneth Nance Jr., Spencer Crim, Martina Meneses`,
        description: `ආදායම් වාර්තා කෙසේ වෙතත් සත්‍යදේව් කියන්නේ කාලෙන් කාලෙට තෙලුගු සිනමාව වෙනස් වෙනස් මාන වලට ගෙනියන නළුවෙක්.. ඉතින් ක්‍රිෂ්ණම්මා ෆිල්ම් එකෙන් පස්සේ 2024 අවුරුද්දේ සත්‍යදේව් ගේ ආපු දෙවෙනි ෆිල්ම් එක තමයි මේ සීබ්‍රා..ඊෂ්වර් කාර්තික්ගේ අධ්‍යක්ෂණයෙන් හැඩවෙන මේ චිත්‍රපටය පැය 2යි මිනිත්තු 44 කට ධාවන කාලයක් හිමි මේ සීබ්‍රා ෆිල්ම් එකේ පිරිවැය ගැන සදහනක් නැතත් මෙහි බොක්ස් ඔෆිස් ඇස්තමේන්තු ආදායම ඉන්දියන් රු.කෝටි 8.25 කට ආසන්නයි. ඇක්ෂන් – ත්‍රිලර් – ක්‍රයිම් ශානරය යටතේ දිවෙන මේ සීබ්‍රා ෆිල්ම් එකට සුභවාදී ප්‍රේක්ෂක ප්‍රතිචාර හිමිවෙලා තියෙනවා බලාගන්න පුළුවන්.සීබ්‍රා බලද්දි.. තෙළුගු / කන්නඩ / දමිළ මේ සිනමා ක්ෂේත්‍ර තුනේම සම්මිශ්‍රනක් වගේ ඔයාලට දැනෙයි.. මොකද ධනන්ජය, සත්‍යරාජ්, සුනිල්, ගරුඩ රාම් වගේ පෙරලිකාර චරිත රැසකට මේ කතාවෙ ඉඩ හසර වෙන් වෙලා තියෙනවා අපිට බලාගන්න පුළුවන්.. ඒවගේම චිත්‍රපටයේ සිංදු 4ක් අන්තර්ගත වෙනවා. මේ ෆිල්ම් එකේ සංගීත අධ්‍යක්ෂණය කරන්නෙත් කන්නඩ පැත්තෙන් KGF වල පවා සංගීත අධ්‍යක්ෂණයෙන් දායක උනු රවී බසෘ‍ර්තුන්වෙනි ඇහෙන් බැලුවොත් මිනිස්සු සතුටින් තියන්නත් දුකින් තියන්නත් හේතුවෙන එකම දේ සල්ලි… මේ ෆිල්ම් එකෙන් එළියට දෙන්නෙ හොද ආදර්ශයක් ද.. නරක ආදර්ශයක් ද කියලා මම දන්නෙ නෑ.. ඒක බලන ඔයාලගේ දෘෂ්ටි කෝණය අනුව එක එක්කෙනාට වෙනස් වෙන්න පුළුවන්..සූර්යා කියන්නේ බැංකු සේවයෙක්.. ඒවගේම ඔහු පෙම්වතෙක්.. සූර්යාගේ පෙම්වතියත් බැංකුවක වැඩ කරන කෙනෙක් ඒ තමයි ස්වාති.. ස්වාති සහ සූර්යා බැංකු දෙකක තමයි වැඩ කලේ.. වගේම ස්වාති මාරු වීමක් හදාගන්න යන්න ඔන්න මෙන්න තියෙද්දි හිතන්නෙවත් නැති ප්‍රශ්නයක පැටලෙනවා. ඒ තමයි බැංකු ගණුදෙනුකරුවෙක් බැංකුවට ගෙනත් දෙන ලක්ෂ 4ක මුදලක් ස්වාතිගෙ අත් වැරදීමකින් වෙනත් ගිණුමකට මාරු වීම. ඉතින් සූර්යා මේ ප්‍රශ්නය විසදන්න මැදිහත් වීම එක්ක මේ ප්‍රශ්නය බැරෑරුම් තැනකට යනවා.`,
        downloadLink: 'https://t.me/movievresehub/46',
        trailerLink: 'https://www.youtube.com/watch?v=936lWJukp8k&t=9s&pp=ygUMemVicmEgKDIwMjQp',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTsc-GhTEQ1kZDVQJ7PvCi8TFaa4aIQq1HIFw&s',
            '#',
            '#'
        ]
    },
    {
        title: 'Baby John',
        year: '2024',
        genre: ['HISTORY'],
        rating: '6.1',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo'],
        poster: 'https://upload.wikimedia.org/wikipedia/en/2/29/Baby_John_%28title_card%29.jpg',
        banner: 'https://media.dailythanthi.com/h-upload/2024/11/06/19585649-baby-jhon-11-nov-6.webp',
        englishDescription: `An airport security officer races to outsmart a mysterious traveler forcing him to let a dangerous item slip onto a Christmas Eve flight.

Release Date: 2024-12-05

Rating: 6.9IMDb Logo

Cast
Taron Egerton, Jason Bateman, Sofia Carson, Danielle Deadwyler, Theo Rossi, Logan Marshall-Green, Dean Norris, Sinqua Walls, Gil Perez-Abraham, Tonatiuh, Curtiss Cook, Joe Williamson, Josh Brener, Benito Martinez, Edwin Kho, Reisha Reynolds, Adam Stephenson, Michael Scott, Jeff Pope, Raymond Rehage, Nico Bucher, Jill Flint, Kenneth Nance Jr., Spencer Crim, Martina Meneses`,
        description: `හොඳයි එහෙනම් අද අපි මේ අරගෙන ආවේ ළඟදි ආපු Baby John සිනෙමා පටයට සිංහල උපසිරැසියක්. මේක ඇවිල්ලා Thalapathy Vijay ගෙ Theri ෆිල්ම් එකේ රීමේක් එකක්. හැබයි ගොඩක් තැන් අලුතින් ඇඩ් කරලා තියෙනවා සිඳුවීම් දාමයට. කොහොම හරි ලස්සනට යනවා කතාව.කතාව ගැන අලුතින් කියන්න දෙයක් නෑ කියලා හිතනවා. වරුන්.. කීර්ති එහෙනම් ප්‍රියමනාප රංඟනයකින් දායක වෙනවා. පොඩි ළමයත් එහෙමයි. අන්තිමේ ස්පෙශල් කැමියො එකකුත් තියේ😁😁 බලන්නකො එහෙනම්.`,
        downloadLink: 'https://t.me/movievresehub/48',
        trailerLink: 'https://www.youtube.com/watch?v=qyRn3rPRw8w&t=2s&pp=ygURYmFieSBqb2huIHRyYWlsZXI%3D',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRB2ESaGUEb2pIefdtHJSrACWNk36x1srwt1w&s',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSuwF02e4R2nJDBEGcknooyn16bZn79druCt02haQQ6MS6CVRa8Y0muSl2AWYBFAbsFLQM&usqp=CAU',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQwD2KTApPGDT4W6pNjDdKVytwu158r5dCVtw&s'
        ]
    },
    {
        title: 'Red One',
        year: '2024',
        genre: ['HISTORY'],
        rating: '6.1',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo'],
        poster: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSOjKJuXB9HKlRInr12VcjJ6BWM3qBxT5_1Ag&s',
        banner: 'https://i.ytimg.com/vi/3ooxkpCVxv4/maxresdefault.jpg',
        englishDescription: `After Santa Claus (codename: Red One) is kidnapped, the North Pole's Head of Security must team up with the world's most infamous tracker in a globe-trotting, action-packed mission to save Christmas.

Release Date: 2024-10-31

Rating: 7.1IMDb Logo

Cast
Dwayne Johnson, Chris Evans, Lucy Liu, J.K. Simmons, Kiernan Shipka, Bonnie Hunt, Kristofer Hivju, Mary Elizabeth Ellis, Wesley Kimmel, Nick Kroll, Wyatt Hunt, Clayton Cooper, Lanz Duffy, Marc Evan Jackson, Makana David, Samantha Benson, Ashleigh Domangue, Cody Easterbrook, Nikki Garza, Abel Arias, Eric Jermaine Lavette Jr., Pilot Bunch, Juan Alexander, Megan Hayes, Beau Kasdan`,
        description: `Red One කියන්නේ  2024 ඇමරිකානු ක්‍රියාදාම ත්‍රාසජනක චිත්‍රපටයක් මේක  Jake Kasdan විසින්  තමයි අධ්‍යක්ෂණය කලේ. ඩොලර් මිලියන 250 පමණ මුදලක් වියදන් කරලා තමයි මේ ෆිල්ම් එක නිස්පාදන කරලා තියෙන්නේ.මේ චිත්‍රපටය නොවැම්බර් 6 තමයි නිකුත් උනේ.අපි ගොඩක් දන්නා චරිත තමයි මේ ෆිල්ම් එකේ ඉන්නේ ඒ අතර Dwayne Johnson , Chris Evans අයත් ඉන්නවා, ෆිල්ම් එක ගැන මන් මුකුත්ම නොකියා ඉන්නම්, පවුලේ සැම එක්ක බලන්න පුළුවන් ෆිල්ම් එකක්`,
        downloadLink: 'https://t.me/movievresehub/52',
        trailerLink: 'https://www.youtube.com/watch?v=U8XH3W0cMss&pp=ygUPcmVkIG9uZSB0cmFpbGVy',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTNlJWBQl3lLMgz2khaqG9vm0Y-Kmj99-22xQ&s',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSKgKI2hPgvKUBRFsc9duczZYDRWLl45Z8_kkEsS6ZA3lJDGig6LqUbPFQA6G-lMpsvBpY&usqp=CAU',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSD8vbFf1Zm2zgbg9-IZVlCP9gNMHnQbakf5pioBChuDV8ucTm70Vs6dvdT6BD38reHmEE&usqp=CAU'
        ]
    },
    {
        title: 'Weekend in Taipei',
        year: '2024',
        genre: ['HISTORY'],
        rating: '6.1',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo'],
        poster: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTOaiQwPR3WJL6w_y7lU0394fBP8s1rdfXUkQ&s',
        banner: 'https://m.media-amazon.com/images/S/pv-target-images/fba7b441c6a5c241426ef17320be62b1e20810415851cc1c235b7e648ebcb780.jpg',
        englishDescription: `A former DEA agent and a former undercover operative revisit their romance during a fateful weekend in Taipei, unaware of the dangerous consequences of their past.

Release Date: 2024-09-19

Rating: 6.2IMDb Logo

Cast
Luke Evans, Gwei Lun-Mei, Sung Kang, Wyatt Yang, Pernell Walker, Zach Ireland, Patrick Lee, Virginia Chien, Lu Yi-ching, Tou Tsung-Hua, Tjarret Yong, Erin Adele Clark, Janet Hsieh, Alain Figlarz`,
        description: `ප්‍රංශ, තායිවාන් සම නිෂ්පාදනයක් වූ නවතම ඉංග්‍රීසි ඇක්ෂන් චිත්‍රපටයකට තමයි අද උපසිරැසියක් ගෙනාවෙ. 2024 සැප්තැම්බර් 25 දින ප්‍රංශයේ සහ තායිවානයේ තිරගත කිරීම ඇරැඹි මේ සිනමා පටය තමයි Weekend in Taipei. විනාඩි 101 ක ධාවන කාලයකින් යුතුවන අතර Action, Crime, Drama, Thriller විදිහට වර්ග කරන්න පුලුවන්. තායිවානයේදී ආරම්භක සති අන්තයේම ඉහලම බොක්ස් ඔෆීස් ආදායමට හිමිකම් කිවූ අතර මේ වනවිට ඇ. ඩො. මිලියන 2.8 ක බොක්ස් ඔෆීස් ආදායමක් උපයාගෙන තියෙනවා. ප්‍රධාන චරිත තුනට දායක වෙන්නේ Luke Evans (ජෝන් ලෝලර්), Gwei Lun-mei (ජෝයි) සහ Sung Kang (ක්වාං).වසර ගණනාවකට පෙර, ඇමරිකානු DEA නියෝජිත ජෝන් ලෝලර්, අපරාධ පාතාල ලෝකයේ ප්‍රකෝටිපති ව්‍යාපාරිකයෙක් වන කිං ක්වාං ගැන විමර්ශනය කිරීමට රහසිගතව තායිවානයට යනවා. එම සංවිධානයේ මත්ද්‍රව්‍ය බෙදාහරින රියදුරෙක් වන සුරූපී ජෝයි සමග ආදරයෙන් බැඳෙන ජෝන්ට, තම රැකියාව නිසා ඇයගෙන් වෙන්වෙන්න සිදුවෙනවා. නමුත් ඒ වනවිට ඇය ඔහු නිසා ප්‍රෙග්නන්ට් බව ජෝන් දැනගන්නේ නෑ. ඉන් වසර 15 කට පසු,, ක්වාං අත් අඩංගුවට ගැනීමට හැකියාව ලැබෙන සාක්ෂියක් පිළිබඳව ලැබෙන ඔත්තුවක් නිසා, සති අන්ත නිවාඩුවක මුවාවෙන් ජෝන් නැවතත් තායිවානයේ, තායිපේ වලට එනවා. නමුත් ඒ වනවිට අපරාධකාර ක්වාංගේ බිරිඳ වන්නේ ඔහුගේ අතීත පෙම්වතිය වන “ජෝයි” කියල දැනගැනීමත් සමගම ඔහුගේ නිවාඩුව, ඔහුගේ ජීවිතය වෙනස් කල පෙරලිකාර සති අන්තයක් වන්නේ නොසිතූ විදිහටයි.`,
        downloadLink: 'https://t.me/movievresehub/57',
        trailerLink: 'https://www.youtube.com/watch?v=pPwLXK7ot2E&pp=ygUZd2Vla2VuZCBpbiB0YWlwZWkgdHJhaWxlcg%3D%3D',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ1nnj7HcNON1nZ1V5WLFsXHD3pMs0wMGmmqg&s',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSUJyhzrEjQ4Q3zIv3M55TukpYVFK99utwG_4gHp6lgGg1dj70p7hu6XgQEHPXSa4ihJ7E&usqp=CAU',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRonRZqs-lvHLTpL1Q5rZ7nUYFVmu7Xog-q2Ix-VksyDziRPQjFRDuV4NfaYM1_acwF5uQ&usqp=CAU'
        ]
    },
    {
        title: 'Bonhoeffer',
        year: '2024',
        genre: ['HISTORY'],
        rating: '6.1',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo'],
        poster: 'https://upload.wikimedia.org/wikipedia/en/a/a2/Bonhoeffer_film_poster.jpg',
        banner: 'https://images.ctfassets.net/5a0zbg81idj6/01cj92OeoWmePSk9pU2RO3/68d9567c0f22d182213df04679d198c6/Bonhoeffer_-_Key_Art_-_Digital_-_NO_BILLING_-_16x9.jpg?h=1152&w=2048&q=100&fm=webp&',
        englishDescription: `As the world teeters on the brink of annihilation, Dietrich Bonhoeffer joins a deadly plot to assassinate Hitler, risking his faith and fate to save millions of Jews from genocide.

Release Date: 2024-11-20

Rating: 6.7IMDb Logo

Cast
Jonas Dassler, Phileas Heyblom, August Diehl, David Jonsson, Moritz Bleibtreu, Nadine Heidenreich, Clarke Peters, Flula Borg, Lisa Hofer, Arthur Riordan, Luise Landau, William Robinson, James Flynn, Greg Kolpakchi, Simon Licht, Mark Wingett, Evan Hart, Vincent Franklin, Patrick Mölleken, Felix von Bredow, John Akanmu, Tim Hudson, Caroline Berry, Marc Bessant, John Keogh`,
        description: `ආයුබෝවන් කියන ගමන් අදත් ආවේ අලුත් ෆිල්ම් එකක් අරගෙන මේ ෆිල්ම් එක නිකුත් උනේ 2024 වර්ෂයේ $25 million මුදලක් වියදන් වෙලා තියෙනවා මේ ෆිල්ම් එක නිස්පාදනය වෙනුවෙන්. 1940 ගණන්වල බර්ලිනය පදනම් කරගෙන තමයි මේ ෆිල්ම් එක හැදෙන්නේ වැඩි විස්තර දැන ගන්න ඕනේ නම් මෙක බලන්න නම වෙනවා`,
        downloadLink: 'https://t.me/movievresehub/60',
        trailerLink: 'https://www.youtube.com/watch?v=WZM90izJ8sI&t=11s&pp=ygUSYm9uaG9lZmZlciB0cmFpbGVy',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQItToxCB71qEEJiOHK76ExuxfsLZLv3LZ8tg&s',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRW_-6hhTqtozsGctgJRvpnyxqjGD3yTFsGuBawBv9Ue8goPain5LiG4BPydr73obk4ISs&usqp=CAU',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSo9iOVixID3cFaX1fVMcgVmqUsxP0Sl11tc6Wht4yj6xP_TSuZw6hwmXGf6mSxQ_c69vA&usqp=CAU'
        ]
    },
    {
        title: 'Identity',
        year: '2024',
        genre: ['HISTORY'],
        rating: '6.1',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo'],
        poster: 'https://m.media-amazon.com/images/M/MV5BNjI0ZGZlMDktNGVhNi00YjZiLWI4ZmQtMjA2MDliMTE3MGJlXkEyXkFqcGc@._V1_.jpg',
        banner: 'https://i.ytimg.com/vi/sNpjmxYY3wM/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLC9npDTlYKriw_QzWHRBTRPzfjicw',
        englishDescription: `As the world teeters on the brink of annihilation, Dietrich Bonhoeffer joins a deadly plot to assassinate Hitler, risking his faith and fate to save millions of Jews from genocide.

Release Date: 2024-11-20

Rating: 6.7IMDb Logo

Cast
Jonas Dassler, Phileas Heyblom, August Diehl, David Jonsson, Moritz Bleibtreu, Nadine Heidenreich, Clarke Peters, Flula Borg, Lisa Hofer, Arthur Riordan, Luise Landau, William Robinson, James Flynn, Greg Kolpakchi, Simon Licht, Mark Wingett, Evan Hart, Vincent Franklin, Patrick Mölleken, Felix von Bredow, John Akanmu, Tim Hudson, Caroline Berry, Marc Bessant, John Keogh`,
        description: `මේ ෆිල්ම් එක ඉස්සර බ්‍රිතාන්‍යයන් ඉන්දියාව යටත් විජිත සමයේ වෙච්ච සිදුවීමක් විදියට තමයි ගලාගෙන යන්නේ..බ්‍රිතාන්‍යය හමුදාවට ගම් වැසියෙක්ගෙන් ආරංචි වෙනවා ඉන්දියාවේ කැළේක නිධානයක් තියෙනවා කියලා..ඉතින් ඒ නිධානය හොයා ගන්න හමුදා කණ්ඩායමක් කැළේට පිටත් කරලා යවනවා..ඒ කැළේ ශාපයක් තියෙනවා කියලා ගම් වැසියන් විශ්වාස කරනවා..ඉතින් මේ ශාපලත් වනාන්තරයේ තියෙන නිධානය මෙයාලට හොයා ගන්න පුළුවන් වෙයිද කියලා දැන ගන්න හැමෝම ෆිල්ම් එක බලන්න..`,
        downloadLink: 'https://t.me/movievresehub/62',
        trailerLink: 'https://www.youtube.com/watch?v=6LSqReemlTk&pp=ygUQaWRlbnRpdHkgdHJhaWxlcg%3D%3D',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRChU7hxHimO65kKZmJ0pfy4PphpEspFT-9TmlWe6lvem2gGmRYFkY-eGdjkEM-AK5GJgg&usqp=CAU',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRZKn4hR9qvuZu2-6d9qVnXRXpC2IXAYAbv-udNx4hna19hQ4P3Z92g0lRJ4zvPlRrgC4U&usqp=CAU',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRtP97oOgO7CY6pLQtV8IFeZRKn0UFA41IbntPVQh5ZVv3RrxiHnZe-oSp2XcM21DjaBGo&usqp=CAU'
        ]
    },
    {
        title: 'Spectre',
        year: '2015',
        genre: ['ROMANCE'],
        rating: '6.1',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo'],
        poster: 'https://m.media-amazon.com/images/M/MV5BMzA5MzFiNDAtYTI0NC00MDE5LTljYTctYTNkODk1OTZlODI5XkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg',
        banner: 'https://e0.pxfuel.com/wallpapers/727/241/desktop-wallpaper-james-bond-spectre-007-spectre.jpg',
        englishDescription: `A cryptic message from Bond’s past sends him on a trail to uncover a sinister organization. While M battles political forces to keep the secret service alive, Bond peels back the layers of deceit to reveal the terrible truth behind SPECTRE.

Release Date: 2015-10-26

Rating: 6.6IMDb Logo

Cast
Daniel Craig, Christoph Waltz, Léa Seydoux, Ralph Fiennes, Monica Bellucci, Ben Whishaw, Naomie Harris, Dave Bautista, Andrew Scott, Rory Kinnear, Jesper Christensen, Alessandro Cremona, Stephanie Sigman, Tenoch Huerta Mejía, Adriana Paz, Domenico Fortunato, Marco Zingaro, Stefano Elfi DiClaudia, Ian Bonar, Tam Williams, Richard Banham, Pip Carter, Simon Lenagan, Alessandro Bressanello, Marc Zinga`,
        description: `1962 වගේ බොහොම ඈත කාලෙක අපිට සිද්ධ වෙනවා ඔහු හමුවෙන්න, එදා අද තරම් ලොකු මුදලක් වෙන් වෙන්නේ නැහැ ඔහු වෙනුවෙන්… අද වගේ ලොකූ මිල අධික, නවීන ගැජට් තිබ්බෙත් නැහැ ඔහු සතුව ලෝකය බේරා ගන්න… නමුත් 1960 විනාශ කාරී සැලසුම පරදන මොහු සදාකාලිකවම සිනමා රසිකයන්ගේ සිත් සතන්තුල බොන්ඩ්, ජේම්ස් බොන්ඩ් ලෙස පැල පදියම් වෙන්නේ එක්තරා හැටියකට නොසිතූ අයුරකින්… ඔහුගේ ආරම්භය කොතරම් නොසලකා හැරියාද කියනවා නම් මුල් වතාවේ ඔහුගේ නිල රථය වෙන්න ඇස්ටල් මාටින් රථයක් සමාගමෙන් ඉල්ලු විට ලැබෙනා ප්‍රති උත්තරය වෙන්නේ ප්‍රතික්ෂේප කිරීමක්…මේ බාධක කම්කටොලු එක්ක 1963 ජේම්ස් බොන්ඩ් 2 වැනි වතාවට අපි හමුවෙන්නේ රුසියානු ආදරවන්තියක් එක්කමයි. ඇය සාර්ථකයි, නමුත් තවම අපි සිනමා ලෝකයේ නියම සලකුණ දකින්නේ නැහැ… ඒ අවස්තාව අපිට උදා වෙන්නේ 1964 රත්තරන් ! රත්තරන් ! එකක්, එදා ඇස්ටල් මාටින් DB 5 රථයක් එකක් රට වටේ යන්න 007 සමත් වෙනවා වගේම… කිසිදා අමතක නොවෙන සතුරෙක් අපි හමුවට ගේන්නත්, ඔහුගේ අරමුණ පරාජය කරන්නත් අපේ මිතුරා, අපේ වීරයා සමත් වෙනවා…කොහොමින් කොහොම හරි 1965 බෝම්බ එකක් සෙල්ලම් කරන්නත්, 1967 වසරේදී ලෝක යුද්ධයක් නවතා ලන්නත් 007 සමත් වෙන්නේ යන්තම් දිවි ගලවාගෙන. ඔහොම තමුන්ගේ ස්වරුපය වෙනස් කරගන්නවා එකක්ම 1970 වෙනකොට පවුලක් පන්සලක් වෙන්නත් ඔහුගේ හිත යොමු වෙනවා… නමුත් ඒ සතුට අවසාන වෙන්නේ දුකක් එකක් කියලා අපි දන්නේ අපි ඔහුත් එකක් හිටිය නිසයි…වසරක් යන්න කලින් ඒ කියන්නේ 1971 සදාකල් පවතින දියමන්තිය පස්සේ යන ඔහු, නැවතත් ස්වරුපය කලින් තත්වයටම පත් කරගෙන… නමුත් ඒ මුහුණ අපිට වැඩි දවසක් දකින්න වෙන්නේ නැහැ 73 ඔහු වුඩු මායාවන් එකක් කැරබියන් දුපත් දෙවනත් කරන විට… ඔහු මෘදු චරිතයක් බවට පත් වෙන්නේ අපේ ඇස් ඉදිරිපිට නමුත් වැඩ එහෙමමයි… ලස්සන කාන්තා රුපයක් පෙන්න බැහැ… හැබැයි ඔහුට එවැනි කාන්තාවන්ගේ බැල්මෙන් අඩුවකුත් නැහැ…`,
        downloadLink: 'https://t.me/movievresehub/107',
        trailerLink: 'https://www.youtube.com/watch?v=ujmoYyEyDP8&t=10s&pp=ygUPc3BlY3RyZSB0cmFpbGVy',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRECM8DNX6rmERq5q_QjaF1chY0sw0xUis_3g&s',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQzoQ0meGA4Voi6sGS-SKTYnCdXMDCqScBFJhpbyGAXoyj4_uQi3uTbyiNRWQ6WxiYOd9U&usqp=CAU',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTL1A8jFjdnQvP9AaFLyGABHg2xwDV-5YEIa0SW3CwIu6uxjoAJMvpFhMsRiukiDzqokNw&usqp=CAU'
        ]
    },
    //fffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff
    
    // Add more movies here...
    {
        title: 'Raabta',
        year: '2017',
        genre: ['ROMANCE'],
        rating: '6.1',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo'],
        poster: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTVvtALOC56-pB0OXMG0b7dyuZjb8OJ5V-WsA&s',
        banner: 'https://assets-in.bmscdn.com/discovery-catalog/events/et00042155-vrplaejvmm-landscape.jpg',
        englishDescription: `An inseparable couple Saira and Shiva find themselves in a complicated situation when a stranger claims to be her reincarnated lover from their previous lifetime, hellbent on destroying their relationship and winning her back.

Release Date: 2017-06-08

Rating: 6.0IMDb Logo

Cast
Sushant Singh Rajput, Kriti Sanon, Jim Sarbh, Vikas Verma, Rajkummar Rao, Karan Singh Chhabra, Varun Sharma, Deepika Padukone`,
        description: `කතාව ගැන කියනවනම් ඔයාලට මතක නම් 2009 වසරේ කාජල් එක්ක රාම් චරන් රගපාපු magadheera චිත්‍රපටය , එහි කතාව අනුසාරයෙන් Dinesh Vijan ගේ අධ්‍යක්ෂණය යටතේ, ක්‍රිති සැනොන් සහ සුශාන් සිංග් රාජ්පුත් විසින් රංගනයට දායක වෙමින්, මේ වසරේ ජුනි මාසයේ තිරගත වීම් ආරම්බ වෙනවා.සයිරා කියන්නේ බුදාපෙස්ට් වල චොක්ලට් කඩයක් කරගෙන යන කෙල්ලෙක් ශිව් කියන්නේ පංජාබ් වලින් බුදාපෙස්ට් වලට එන බෑන්කුකරුවෙක් ශිව් ගේ චාටුබසට වශිවෙන සයිරා ශිව් එක්ක ආදරයක් ඇති කරගන්නවා මේ දෙන්නගේ ආදරය මැද්දට සැක් කියන පුද්ගලයාගේ පැමිණීමත් එක්ක ඔවුන්ගේ ජිවිත මුළුමනින්ම කණපිට පෙරලෙන්න ගතවෙන්නේ එක රැයක් විතරයි.. ඉතින් ඒ කොහොමද කියල ඔයාලම බලන්නකෝ `,
        downloadLink: 'https://t.me/movievresehub/84',
        trailerLink: 'https://www.youtube.com/watch?v=YXjYfpqg8Z0&t=13s&pp=ygUOcmFhYnRhIHRyYWlsZXI%3D',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTxe34lzIw8kBGQhuvVjT555D9bsRN8A1DvjiZLN2tUDdAe2YTxDMoXa6b-7Ieso0ZKhS8&usqp=CAU',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSb21XG4w5KcAf9w8xNI65apqM1sD7QMAdgV55nGmU4xYBqveTzh8TfZwXGRpJEiGd9KQY&usqp=CAU',
            'https://i.ytimg.com/vi/pHQkSH76zjE/maxresdefault.jpg'
        ]
    },
    {
        title: 'Mechanic Rocky',
        year: '2024',
        genre: ['ACTION','Comedy'],
        rating: '6.1',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo'],
        poster: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRhifrKrHpb5eaG4UH7D5Cao4neVBHqnmWD2w&s',
        banner: 'https://img.nowrunning.com/content/movie/2024/mecha-29862/bg2_mechanic-rocky.jpg',
        englishDescription: `Rakesh, a happy-go-lucky young mechanic, must take on the ruthless land grabber Rankireddy to save his beloved ancestral car garage, uncovering unexpected truths.

Release Date: 2024-11-22

Rating: 5.0IMDb Logo

Cast
Vishwak Sen, Meenakshi Chaudhary, Shraddha Srinath, Sunil Varma, Naresh, Hyper Adhi, Harsha Chemudu, Harshavardhan, Vishwadev Rachakonda, Jeevan Kumar, Raghu Ram`,
        description: `2024 වෙනි දින නිකුත් වූ මෙය ඇතුලත් වෙන්නෙ Action / Comedy කියන Category එකට..එක්තරා පුද්ගලයන් තුන්දෙනෙක් එකතුවෙලා කරන වංචාවක් නිසා නිකරුනේ අහිංසකයෙක් ජිවිතේ නැති කරගන්නවා.. හැබැයි එයාගේ නංගි හිතාගෙන ඉන්නේ ඔහු ජිවිතේ නැති කරගන්නේ තමන්ගේ වරදක් නිසා කියලා.. ඇයගේ පෙම්වතා වෙන්නෙ රොකී..පොරට තියෙන්නේ ගරාජ් එකක්.. ඉතින් තමන්ගේ පෙම්වතිය වෙනුවෙන් අර වංචාකාරයන්ට හොද පාඩමක් උගන්නන්න රොකී ගහනවා මරු ප්ලෑන් එකක්.. මුළු කතාවම දුවන්නේ ඒ වටා..මේ ටයිප් ආස අයට බලන්න කියලා ආදරෙන් ආරාධනා කරනවා.`,
        downloadLink: 'https://t.me/movievresehub/82',
        trailerLink: 'https://www.youtube.com/watch?v=tEBYk7cA8Vk&pp=ygUVbWVjaGFuaWMgcm9ja3kgKDIwMjQp',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR5IxcZxwkw0Y7WPi2ITJXse3eXyNHPyR3EBg&s',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ7fXWeSvyHr7NDpLi26R-RNjEYPEhi3tdCb1Jty999eX5s3Jo3c05jOTuNcvjevsZDlQs&usqp=CAU',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTWmRAawqFmxg2gp8Klguv5v6DWNf74rJoSgST1MirxJFflOr8RJNZp4fEgxWRKDc0ylYE&usqp=CAU'
        ]
    },
    {
        title: 'Crush',
        year: '2024',
        genre: ['ACTION','Comedy'],
        rating: '6.1',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo'],
        poster: 'https://assets-in.bmscdn.com/iedb/movies/images/mobile/thumbnail/xlarge/crush-et00352146-1675863265.jpg',
        banner: 'https://assets-in.bmscdn.com/discovery-catalog/events/et00352146-nvbhfmyntr-landscape.jpg',
        englishDescription: `Rakesh, a happy-go-lucky young mechanic, must take on the ruthless land grabber Rankireddy to save his beloved ancestral car garage, uncovering unexpected truths.

Release Date: 2024-11-22

Rating: 5.0IMDb Logo

Cast
Vishwak Sen, Meenakshi Chaudhary, Shraddha Srinath, Sunil Varma, Naresh, Hyper Adhi, Harsha Chemudu, Harshavardhan, Vishwadev Rachakonda, Jeevan Kumar, Raghu Ram`,
        description: `මම අද අඅරගෙන ආවේ කන්නඩ Romance කාණඩයට අයිති ෆිල්ම් එකක්..කලින් මම කරපු Kalinga film එකට ගොඩක් හොද ප්‍රතිචාර තිබ්බා..ඒකට Comment එකක් දාලා ප්‍රතිචාර දක්වපු හැමෝටම ස්තූතියි..මේකත් කම්මැලි නැතුව ලස්සනට ගලාගෙන යන ආදර කතාවක්..දන්න්වනේ ඉතින් කන්නඩ ආදර කතා වල ගුණාත්මක භාවය ගොඩක් හොදයි කියලා..මම අද ෆිල්ම් එක ගැන විස්තර කියන්නේ නෑ මොකද ඒක කිව්වම ගතියක් නෑ බලන අයට feeling එකක් එන්නේ නෑ එතකොට..එහෙනම් මේ ලස්සන ආදර කතාව හැමෝම අරගෙන බලන්න..`,
        downloadLink: 'https://t.me/movievresehub/103',
        trailerLink: 'https://www.youtube.com/watch?v=SSTVnIu_xAU&t=17s&pp=ygUSY3J1c2ggMjAyNCB0cmFpbGVy',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ5G5lsVJjorW41bKOXmAR3D4qNYI9cIdtq_w&s',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQqgtWHpaPS8anfCG4wpGSn0x-LDd6NEGAxcZxopJUyWSBQMfMA6myxhsUNf6FB3Ulb8T4&usqp=CAU',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSI5nrj1KIL4Iq10AFKJuuhWeZPCCU4UiBamw&s'
        ]
    },
    {
        title: 'Miss You',
        year: '2024',
        genre: ['ROMANCE'],
        rating: '6.1',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo'],
        poster: 'https://d229kpbsb5jevy.cloudfront.net/firstshows/content/portrait/movie/images/pzpldf.jpeg',
        banner: 'https://i.ytimg.com/vi/NzvO1RRTEXo/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLAG1N5-u1BAoxuaQc0V0tOfAt9vDA',
        englishDescription: `What happens when a guy falls in love with the girl he thought he hated the most? Why does her simple 'no' mean so much more than it seems?.

Release Date: 2024-12-13

Rating: 6.1IMDb Logo

Cast
Siddharth, Ashika Ranganath, Karunakaran, Balasaravanan, Sastika Rajendran, Lollu Sabha Maaran, Ponvannan, Sharath Lohitashwa, Jayaprakash, Nakkalites Arun Kumar, Anupama Kumar`,
        description: `මේ පාර ලස්සන ලව් ස්ටෝරි එකක් තියෙන කතාවක් තමයි අරන් ආවේ. කම්මැලි නැතුව බලන්න පුලුවන් ලස්සන කතාවක් ඉතින් අපි හැමෝම දන්න Siddharth තමයි මේකෙ ප්‍රදාන නළුවා විදියට රන්ගනයෙන් දායක වෙන්නේ ඒ වගේම මේ කතාව අද්‍යක්ෂනය කරන්නේ N. Rajasekar රචනා කරල තියෙන්නේ R. AshokN. සහ  Rajasekar ඒ වගේම Anupama Parameswaran, Ashika Ranganath, Bala Saravanan, V. Jayaprakash වගේ ගොඩක් අය රන්ගනයෙන් දායක වෙනවා.කතාව පැත්තට ගියොත් වාසූ (Siddharth) කියන්නේ අම්මයි තාත්තයිඑක්ක සතුටින් ජීවත් වෙන කොල්ලෙක් මේ අතරෙ මෙයා මේ පලාතෙ ඉන්න ඇමතිතුමාගෙ පුතත් එක්ක ලොකු ප්‍රශ්නයක් දාගන්නේ. ඊට පස්සෙ තමයි මෙයාට ලොකු අනතුරකට මුහුණ දෙන්න වෙන්නේ.ඊට පස්සෙ බැංගලෝර් වලදි සුබ්බලක්ශ්මී කියල කෙල්ලෙක් මුනගැහෙනව. ඇත්තටම කතාව පටන් ගන්නෙ දැන් තමයි.ඉතින් වාසු කියන්නෙ කවුද? වාසු ඇක්සිඩන්ට් වෙන්න හේතුව මොකක්ද එතකොට සුබ්බලක්ශ්මී කියන්නෙ කවුද? මේ ටික දැන ගන්නනම් ෆිල්ම් එක බලන්නම වෙනවා`,
        downloadLink: 'https://t.me/movievresehub/78',
        trailerLink: 'https://www.youtube.com/watch?v=kMW9SzEJlk4&pp=ygUQbWlzcyB5b3UgdHJhaWxlcg%3D%3D',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTbRROPTdK9PTWTsTm4bP695DOK-suKh2T4DA&s',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTjIzowqVlIxV1PHnEwWJ2UtDjRoUhOlnNFAfH80ZmPSWZFy6t-aXuHGcqLG_UITZxLYKo&usqp=CAU',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSc72GoJ1PSiLkNc-H28IUoZv9RW762VxG1QjRmjRaCQyGqG1XclRwu1T-9kIGjCs2oZWw&usqp=CAU'
        ]
    },
    {
        title: 'Love Reddy',
        year: '2024',
        genre: ['ROMANCE'],
        rating: '6.1',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo'],
        poster: 'https://images.sr.roku.com/idType/roku/context/global/id/da7cd911f257a47a6d0e3aadab86002c/images/gracenote/assets/p29256936_v_v12_aa.jpg/magic/396x0/filters:quality(70)',
        banner: 'https://m.media-amazon.com/images/S/pv-target-images/2cef6954303a57638e6c6dbb404b7ceafc3f3b375eb017c4cae4cd62acdee9e2.jpg',
        englishDescription: `What happens when a guy falls in love with the girl he thought he hated the most? Why does her simple 'no' mean so much more than it seems?.

Release Date: 2024-12-13

Rating: 6.1IMDb Logo

Cast
Siddharth, Ashika Ranganath, Karunakaran, Balasaravanan, Sastika Rajendran, Lollu Sabha Maaran, Ponvannan, Sharath Lohitashwa, Jayaprakash, Nakkalites Arun Kumar, Anupama Kumar`,
        description: `මේ අවුරුද්දේ නිකුත් වූ මෙය ඇතුලත් වෙන්නෙ Romance කියන Category එකට..එක්තරා කෙල්ලෙක්ට පිස්සුවෙන් වගේ ආදරේ කරන කොල්ලෙක් වටා තමයි කතාව යන්නෙ.. වැඩේ කියන්නෙ කෙල්ල කොල්ලට කොච්චර ආදරේ උනත් ඒක පෙන්නන්නැති එක, අන්තිමට ඒක නිසා කෙල්ලට ජීවිතෙන් පවා වන්දි ගෙවන්න වෙනව, හැම එකකම වගේ මේ ආදර කතාවටත් උදැල්ල දාන කෙනෙක් ඉන්නව, සේරම බලාගන්න නම් ෆිලුම බලන්නම වෙනව..`,
        downloadLink: 'https://t.me/movievresehub/76',
        trailerLink: 'https://www.youtube.com/watch?v=dZtpYTNCDq0&pp=ygUSbG92ZSByZWRkeSB0cmFpbGVy',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTCrOygj0H017P4rIw9MznH-9IaAvwz7aAr5g&s',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS3AOQegelszl9efTU5p5q3oFsMmT5YDQV2sUZKldO5suE1KT_u3lWUfornkBiccxVyLXY&usqp=CAU',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRqKTmS3_W1IuFXEhtgpk-ivTYwtWxWqlHFQE4JC3KclCicieHfML3JQuhkui_-U6W3sRE&usqp=CAU'
        ]
    },
    {
        title: 'The Shadow Strays',
        year: '2024',
        genre: ['ACTION'],
        rating: '6.1',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo'],
        poster: 'https://image.tmdb.org/t/p/original/zzYtfpTvAZ1J0IU1p9mTOcUK2qo.jpg',
        banner: 'https://i.ytimg.com/vi/CXqE5IwHJQY/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLC7cQk_ns6dEA88zSYKyM9-h_gLDQ',
        englishDescription: `Skilled in the art of killing, a young assassin defies her mentor to save a boy from a ruthless crime syndicate — and she'll destroy anyone in her path.

Release Date: 2024-09-10

Rating: 7.2IMDb Logo

Cast
Aurora Ribero, Hana Malasan, Andri Mashadi, Adipati Dolken, Kristo Immanuel, Ali Fikry, Taskya Namya, Arswendy Bening Swara, Chew Kin-Wah, Agra Piliang, Daniel Eka Putra, Tanta Ginting, Yayan Ruhian, Eva Celia, Mawar Eva De Jongh, Hiroaki Kato, Nobuyuki Suzuki, Naomi Christy, Jesyca Marlein, Candace Gabriel Bianca, Banon Gautama, Shanna Miaziza, Lukas Will, Anty Indah, Evi Fauziah`,
        description: `ඔන්න ගායිස්, මාෂල් ආට් ඇක්ෂන් ෆිල්ම් බලන්න කැමති අයට මේ පාර අරගෙන ආවා “ටෝනි ජා ටයිප්” එකේ සුපිරි භාණ්ඩයක්. අනික මේකෙ 17 හැවිරිදි, නොම්මර 13 ලෙස ප්‍රධාන නිලි චරිතයට පණ පොවන Aurora Ribero පෙනුමෙනුත් ටෝනි ජා වගේමයි. ටෝනිගෙ නංගි කිව්වත් කවුරුවත් සැක කරන්නෙ නෑ. මුල සිට අග වෙනකල්ම නොනවතින සටන් රැල්ලකින් සමන්විත මේ ෆිලුම මඟහැර ගත්තොත් විශාල පාඩුවක්, බ්‍රෝ. Gun Fu, Martial Arts, Action, Crime, Thriller ෆිලුමක් වන මේ ඉන්දුනීසියන් නිර්මාණය Rotten Tomato මීටරයත් 91% දක්වා කරකවන්නට සමත්වෙලා තියෙනවා. ඒ තමයි Shadow Strays. මූලිකවම 2024 ටොරොන්ටෝ අන්තර්ජාතික සිනමා සම්මාන උලෙළේදී, 2024 සැප්තැම්බර් 24 දින රිදී තිරය මත දිගහැරුනු අතර 2024 ඔක්තෝබර් 17 දින නෙට්ෆ්ලික්ස් හරහා ඩිජිටල් ලෝකයට එකතු වුනා. ඔයාලට මතක නම් 2018 ආපු The Night Comes for Us චිත්‍රපටය අධ්‍යක්ෂනය කල Timo Tjahjanto ගෙ වැඩක්. Aurora Ribero (නොම්මර 13 / නෝමි) සමග රංගනයෙන් එකතුවෙනවා Hana Malasan (උම්බ්‍රා), Taskya Namya (සොරියා), Andri Mashadi (ඒරියල්), Ali Fikri (මොන්ජි) සහ Kristo Immanuel (ජෙකී). ධාවන කාලය පැය 2 විනාඩි 24 යි.රහසිගත ඝාතන සංවිධානයක සාමාජිකාවක් තමයි 17 හැවිරිදි, නොම්මර 13. එයාලට නම් නෑ. අංක තියෙන්නෙ. මොකද එයාලට අතීතය අමතක කරවල තියෙන්නෙ. අනුකම්පාවක් නැති ඝාතන මැෂින්. ජපානයේ කල මෙහෙයුමකදී සංවේදී වීම නිසා නොම්මර 13 අසාර්ථක වෙනවා. ඒ නිසා ඇයව නැවත මානසික පුහුණුවක් සඳහා ටික කාලයකට මෙහෙයුම් වලින් ඈත් කරල තියන්න, ඇගේ උපදේශිකාව වන ඒජන්ට් උම්බ්‍රා තීරණය කරනවා. ඉතින් ජාකර්තාවල ඇය ඒ විවේක කාලය ගත කරමින් සිටියදී, අසල නිවසක 11 හැවිරිදි පිරිමි ළමයෙක් වන මොන්ජි සමග මිතුරු වෙනවා. මොන්ජිගෙ තාත්තා නෑ. මත්ද්‍රව්‍ය වලට ඇබ්බැහි වුනු කෙනෙක් වන අම්මා, ජාකර්තාවල දරුණුම පාතාල සංවිධානයට සම්බන්ධයි. ඒ සංවිධානයේ ඉහලින්ම ඉන්නෙ හාගා (මිනිස් ජාවාරම්කාරයෙක්), ප්‍රස්ටියෝ (දූෂිත පොලිස් ලොක්කෙක් ) සහ ඒරියල් (ආණ්ඩුකාර අපේක්ෂකයෙකුගේ ධනවත් පුතෙක්). යම් හේතුවකට මෙයාලා මොන්ජිගෙ අම්මව මරනවා. අම්මට ගොඩක් ආදරේ කරන කුඩා මොන්ජි, අම්මගෙ පලිය ගන්න යනවා. ඊට පස්සෙ මොන්ජි අතුරුදහන්. අහම්බෙන් හඳුනගත්තත්, මොන්ජිට ලොකු සෙනෙහසක් දක්වන නොම්මර 13, අසරණ මොන්ජි සොයා බිහිසුනු ජාකර්තා පාතාලයට අඩිය තියනවා. ඊට පස්සෙ ඉතින් ඩාම්, ඩූම් තමයි.මේක ළමයින්ට නම් සුදුසු නෑ. චූටිම චූටි 18+ සීන් කෑල්ලක් දෙකක් තියෙනවා. අඩු තරමේ කිස් කරන එකක්වත් නෑ. අනික අමානුෂික දර්ශන තියෙනවා.`,
        downloadLink: 'https://t.me/movievresehub/74',
        trailerLink: 'https://www.youtube.com/watch?v=jsKo8nvOfck&pp=ygUZVGhlIFNoYWRvdyBTdHJheXMgdHJhaWxlctIHCQmtCQGHKiGM7w%3D%3D',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSXb3mMf5x7W4JlrpD5j97H6UZr_-s9bFq7Lg&s',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRzeS77XxLpCqWjv_4HF4cG4x7AC4KQlpsMykRpJbZ0tzfwBM9D6jw5xeIfbpfX4rZg_QY&usqp=CAU',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTJuWt5vPawVDxbN8XWX8LFPpcWGd-SdtvDpw&s'
        ]
    },
    {
        title: 'Fateh',
        year: '2025',
        genre: ['ACTION'],
        rating: '6.1',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo'],
        poster: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRyzPQMqm52k5hVjnuAADhL2k3JCSChmQEDkg&s',
        banner: 'https://static.sociofyme.com/thumb/imgsize-100192,msid-151107160,width-400,height-225,resizemode-1,webp-1/151107160.jpg',
        englishDescription: `Ex-Special Ops officer Fateh Singh springs back to action when a girl falls prey to a cybercrime syndicate. Racing against time, can he bring down the mafia?

Release Date: 2025-01-10

Rating: 5.4IMDb Logo

Cast
Sonu Sood, Jacqueline Fernandez, Naseeruddin Shah, Vijay Raaz, Shivjyoti Rajput, Dibyendu Bhattacharya, Prakash Belawadi, Akashdeep Sabir, Sheeba, Binnu Dhillon, Soundous Moufakir, Virral Patel, Shubham Chaudhary, Meetali Pravin Diwate, Ziyan Noorani, Gehna Arora, Suraj Jumani, Aaditya Dhanraj, Nyra Sachar, Rehaan Sachar, Nishan Cheema, Simran Rana, Atharva Bathia, Kiranbir Kaur, Onkar Gill`,
        description: `ඉතින් මේ ෆිල්ම් එක ගැන මම අමුතුවෙන් කියන්න ඕන නෑනෙ.. ඔයාලා ගොඩක් අය බලාගෙන ඉදපු ෆිල්ම් එකක් වෙන්න ඇති.. සෝනු සූද් වගේම ජැක්ලින් ප්‍රධාන චරිත වලින් රංගනයෙන් දායක වෙන මේ ෆිල්ම් එක ඇක්ෂන් කැටගරි එකට තමයි අයිති වෙන්නෙ..ඉතින් කතාව ගැන කෙටියෙන් කියනවනම් සයිබර් මාෆියාවක් ගැන තමයි ෆිල්ම් එකේ ඇතුලත් වෙලා තියෙන්නෙ.. ඒ වගේම ඔයාලට හොද ඇක්ෂන් ටිකකුත් මේ ෆිල්ම් එකෙන් බලාගන්න ලැබෙයි.ඉතින් මම මීට වඩා මොනවත් කියන්නෙ නෑ ඔයාලටම මේ සුපිරිම ෆිල්ම් එක බලන්න කියලා ආරාධනා කරනවා`,
        downloadLink: 'https://t.me/movievresehub/72',
        trailerLink: 'https://www.youtube.com/watch?v=_qC4mq13crc&pp=ygUNRmF0ZWggdHJhaWxlcg%3D%3D',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSGE7AvoOSXR-lBGEDq4NfXe2LzVc8H6t7uW-RX9b2y1ikiY7C_F3Ylv0J80CSVAq8PV5c&usqp=CAU',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQmWaOeE1FB2KAufmoh4J3Xi9Db_J1Rn5rgzTLW05_K0yaAuzsPLVG5ENO_tUFDAi4031w&usqp=CAU',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSpDTsihy4DBgD0ufQ8PnMbaiqJBwZo-SkW03jj-PLiqndyd8CDvGdnlNijtNS7Zc4OdrE&usqp=CAU'
        ]
    },
    {
        title: 'Family',
        year: '2024',
        genre: ['THRILLER'],
        rating: '6.1',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo'],
        poster: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQvlF8uZ28umv5KYyeBkwfPegKaT9ALgNRYCWMqGWZlMr-xVrIWOVaz7G6_GC_FW9IiF9Q&usqp=CAU',
        banner: 'https://i.ytimg.com/vi/lGuiMPfwTy4/hq720.jpg?sqp=-oaymwE7CK4FEIIDSFryq4qpAy0IARUAAAAAGAElAADIQj0AgKJD8AEB-AH-CYAC0AWKAgwIABABGCkgTSh_MA8=&rs=AOn4CLDyvQ6GB6jEtxq6vWyaabZcI__DAw',
        englishDescription: `Ex-Special Ops officer Fateh Singh springs back to action when a girl falls prey to a cybercrime syndicate. Racing against time, can he bring down the mafia?

Release Date: 2025-01-10

Rating: 5.4IMDb Logo

Cast
Sonu Sood, Jacqueline Fernandez, Naseeruddin Shah, Vijay Raaz, Shivjyoti Rajput, Dibyendu Bhattacharya, Prakash Belawadi, Akashdeep Sabir, Sheeba, Binnu Dhillon, Soundous Moufakir, Virral Patel, Shubham Chaudhary, Meetali Pravin Diwate, Ziyan Noorani, Gehna Arora, Suraj Jumani, Aaditya Dhanraj, Nyra Sachar, Rehaan Sachar, Nishan Cheema, Simran Rana, Atharva Bathia, Kiranbir Kaur, Onkar Gill`,
        description: `ඇත්ත කිව්වොත් මේකෙ ලොකු ස්ටෝරියක් නෑ , කේරලේ කදුකර පැත්තක ක්‍රිස්තියානි මිනිස්සුන්ගෙ චාරිත්‍ර , දින චර්‍යාව වගේ දේවල් තියෙන ෆිල්ම් එකක් ,  Drama Thriller කාණ්ඩයන්ට තමයි අයිති , Vinay Forrt , Mathew Thomas එහෙම රංගනයෙන් දායක වේනවා , කොල පාට පරිසරය එහෙම පේන්න තියෙනවා , කැමති අය බලන්න`,
        downloadLink: 'https://t.me/movievresehub/70',
        trailerLink: 'https://www.youtube.com/watch?v=seZOECtkkOE&pp=ygUUZmFtaWx5IDIwMjQgdHJhaWxlciA%3D',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQlVmTJi5mqrUSSdEhdLWMagJvZvhnacZK1f2WX2IZQPZAu0jz4EKEHXj41pWtq1lM4QAI&usqp=CAU',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSkn12inGmVak_J1dwNW2RwG3SiYt2bmfs_WzJj7tc6gulED2HTQs14JBKYSYVICeuzHdQ&usqp=CAU',
            '#'
        ]
    },
    {
        title: 'Respati',
        year: '2024',
        genre: ['HORROR', 'FANTASY'],
        rating: '6.1',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo'],
        poster: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSrdjDK7fZojaNIncZJSs9IsxXpM4H_fhHVk7cp-dkTkCgolszOXPnEf7_Hj9-i-Bs8iKY&usqp=CAU',
        banner: 'https://image.tmdb.org/t/p/original/1fjNXn1VvV7JcBHPXsRjtSzWCUK.jpg',
        englishDescription: `A teenager with the ability to enter other people's dreams. When he witnesses a dark spirit taking people's lives in their dreams, he quickly realizes that it's related to the mysterious deaths that are happening in the real world.

Release Date: 2024-05-22

Rating: 6.2IMDb Logo

Cast
Devano Danendra, Mikha Hernan, Ratu Felisha, Keisya Levronka, Fajar Nugra, Kiki Narendra, Budi Ros, Brilliana Desy Dwinawati, Dinar Roos, Sri Isworowati, Maychelina Anis, Eko Budi Antara, Khayla Maharani, Aisya Maharani, Olive Nugroho, Liek Suyanto, Tuminten, Kukuh Riyadi, Nizar Azza Faezya, Diajeng Shinta, Kevin Abani, Petrus Billy, Joanna Dyah, Windo, Cahya Aditya`,
        description: `Horror/Fantasy කාණ්ඩයට අයත්වන චිත්‍රපටිය අධ්‍යක්ෂණය කරන්නේ Sidharta Tata. චිත්‍රපටියේ ධාවන කාලය පැය 1 මිනිත්තු 52. Devano Danendra, Keisya Levronka, Mikha Hernan ඇතුලු නලු නිලියන් චරිත නිරූපණය කරනවා.කතාව ලොකුවට කියන්න නම් මගේ බලාපොරොත්තුවක් නෑ. එහෙනම් ඉතිරිය ඔයාලට භාරයි.`,
        downloadLink: 'https://t.me/movievresehub/68',
        trailerLink: 'https://www.youtube.com/watch?v=nq-I91450p4&pp=ygUQUmVzcGF0aSB0cmFpbGVyIA%3D%3D',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQLnVH6dyhmyt8YHj9qGdsCfrgwuYeoeXeMeA&s',
            'https://i0.wp.com/bsidesbadlands.com/wp-content/uploads/2024/09/The-Draft-Horror-Film-2024-Fantastic-Fest-Review.jpg?fit=800%2C534&ssl=1&resize=350%2C200',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSXO_C1qxlbOBCnq4mtWlKbA6qQ8OFyBol7dNpo-lytUBkaMcuwDvs9BTEXDBp6Wt4b66A&usqp=CAU'
        ]
    },
    {
        title: 'Deliver Us',
        year: '2023',
        genre: ['ROMANCE'],
        rating: '6.1',
        releaseDate: '2024-09-27',
        cast: ['Carrie-Anne Moss', 'Douglas Smith', 'Frank Grillo'],
        poster: 'https://i0.wp.com/themoyaview.com/wp-content/uploads/2024/02/img_6846-1.jpg?resize=694%2C1024&ssl=1',
        banner: 'https://image.tmdb.org/t/p/original/1fjNXn1VvV7JcBHPXsRjtSzWCUK.jpg',
        englishDescription: `When a nun in a remote convent claims immaculate conception, the Vatican sends a team of priests to investigate, concerned about an ancient prophecy that a woman will give birth to twin boys: one the Messiah, the other the Antichrist.

Release Date: 2023-08-30

Rating: 5.5IMDb Logo

Cast
Lee Roy Kunz, Maria Vera Ratti, Alexander Siddig, Jaune Kimmel, Thomas Kretschmann, Jelena Rajapu, Anil Kapur, Kätlin Hallik, Vivek Tyagi, Marina Puškar, Marika Inga Roosaar, Lena Barbara Luhse, Ene Pappel, Boris Lee Krutonog, Kalmer Umbleja, Riho Reismaa, Katariina Unt, Aleksander Mikoš McCarthy, Hans Robert Varts, Rain Tolk, Kersti Heinloo, Juri Žilin, Merle Jääger, Muhammad Qazi Junaid Iqbal, Marko Leht`,
        description: `අපි දැන් කාතාව පැත්තට පොඩ්ඩක් යමු…මේ කතාව ටිකක් අමුතු කාතාවක්…හිතන්න ටිකක් තියෙනවා  ෆිල්ම් එක තෙරේන්න නම් අපි සම්පූර්ණ අවධානය දෙන්න ඔනි..ෆිල්ම් එක ගැන කෙටියෙන් කියනවනම් කීස්තුත්වය හා බැදි කාතාවක් කියන්නත් පුලුවන්…නරක – හොද යන දෙපැත්තකට උපන් දරුවන් දෙන්නෙක් අතර නිර්මාණය වුන කාතාවක්..ළදරු අවදියේ සිටම යකෂ- වේශයෙන් තම මල්ලි මැරිමට සිතන සහෝදරයයෙක්…..මවකගේ සෙනහස ද…,යකෂ- දේව  ගැටුම් මේ සියල්ල ගැබ් වු නිර්මාණක්…තව ද මේ ෆිල්ම් එකේ නිරැවත් දර්ශන ඇති නිසා 18+🔞🔞වැඩිහිටි අයට වාඩාත් සුදුසුයි….හරි එහෙනම් අදට ඇති…..`,
        downloadLink: 'https://t.me/movievresehub/66',
        trailerLink: 'https://www.youtube.com/watch?v=hlEo8c68cQ0&pp=ygUSRGVsaXZlciBVc3RyYWlsZXIg',
        gallery: [
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ91MlEFcWkI48UD5unvvbPt6cac8nYwgZCQw&s',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRFVeeGlGqXbAKOfZ3KCUdnzw6piOuPAPgGiw&s',
            'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcStr8itNEKem3mBUsnPsmBq9bU3nL49GsEwvaXcaBE1KsJcftJmZxT0LELrfXRzrzBkcTs&usqp=CAU'
        ]
    }
];
